Repository: OPR-Project/OpenPlaceRecognition
Catalog: docs/source/locale/*/LC_MESSAGES/api/index.po
Languages: ru

source: API Reference
ru: Справочник API

source: OpenPlaceRecognition package.
ru: Пакет OpenPlaceRecognition.

source: Definition of package-level constants.
ru: Определение констант уровня пакета.

source: Testing functions implementation.
ru: Реализация функций тестирования.

source: Calculate Recall@N, Recall@1% and mean top-1 distance for the given query and db embeddings.
ru: Вычислить Recall@N, Recall@1% и среднее расстояние top-1 для заданных query и db embeddings.

source: Parameters
ru: Параметры

source: Query embeddings array.
ru: Массив query embeddings.

source: Database embeddings array.
ru: Массив database embeddings.

source: Distance matrix of shape (query_len, db_len).
ru: Матрица расстояний формы (query_len, db_len).

source: Distance threshold for positive match. Defaults to 25.0.
ru: Порог расстояния для положительного соответствия. По умолчанию 25.0.

source: The maximum N value for the Recall@N metric. Defaults to 25.
ru: Максимальное значение N для метрики Recall@N. По умолчанию 25.

source: Returns
ru: Возвращает

source: (Recall@N, Recall@1%, mean top-1 distance). The 'mean top-1 distance' metric may be `None` if Recall@1 = 0.
ru: (Recall@N, Recall@1%, среднее расстояние top-1). Метрика 'среднее расстояние top-1' может быть `None`, если Recall@1 = 0.

source: (Recall@N, Recall@1%, mean top-1 distance).
ru: (Recall@N, Recall@1%, среднее расстояние top-1).

source: The 'mean top-1 distance' metric may be `None` if Recall@1 = 0.
ru: Метрика 'среднее расстояние top-1' может быть `None`, если Recall@1 = 0.

source: Return type
ru: Тип возвращаемого значения

source: Query front image embeddings array.
ru: Массив query embeddings для передних изображений.

source: Query back image embeddings array.
ru: Массив query embeddings для задних изображений.

source: Evaluates the model on the test set.
ru: Оценивает модель на тестовом наборе.

source: The model to test.
ru: Модель для тестирования.

source: The data loader for the test set.
ru: Загрузчик данных для тестового набора.

source: The distance threshold for a correct match. Defaults to 25.0.
ru: Порог расстояния для правильного соответствия. По умолчанию 25.0.

source: Device ("cpu" or "cuda"). Defaults to "cuda".
ru: Устройство ("cpu" или "cuda"). По умолчанию "cuda".

source: Array of AverageRecall@N (N from 1 to 25), AverageRecall@1% and mean top-1 distance.
ru: Массив AverageRecall@N (N от 1 до 25), AverageRecall@1% и среднее расстояние top-1.

source: Array of AverageRecall@N (N from 1 to 25), AverageRecall@1%
ru: Массив AverageRecall@N (N от 1 до 25), AverageRecall@1%

source: and mean top-1 distance.
ru: и среднее расстояние top-1.

source: Raises
ru: Вызывает

source: If the required coordinate columns are not found in the dataset.
ru: Если необходимые столбцы координат не найдены в наборе данных.

source: Test Place Recognition Average Recall@N metric performance.
ru: Тестирование производительности метрики Average Recall@N для Place Recognition.

source: Test dataloader object.
ru: Объект тестового загрузчика данных.

source: Package-level utility functions.
ru: Вспомогательные функции уровня пакета.

source: Updates dst_dict with values from src_dict.
ru: Обновляет dst_dict значениями из src_dict.

source: Recursively traverses the src_dict dictionary and appends values to lists in dst_dict. If a key does not exist in dst_dict, it is created with a new list containing the corresponding value.
ru: Рекурсивно обходит словарь src_dict и добавляет значения в списки в dst_dict. Если ключ не существует в dst_dict, он создается с новым списком, содержащим соответствующее значение.

source: A dictionary representing statistics for an epoch.
ru: Словарь, представляющий статистику для эпохи.

source: A dictionary representing statistics for a step within an epoch.
ru: Словарь, представляющий статистику для шага внутри эпохи.

source: A dictionary representing updated statistics for an epoch.
ru: Словарь, представляющий обновленную статистику для эпохи.

source: Example usage:
ru: Пример использования:

source: Converts cartesian coordinates to spherical coordinates.
ru: Преобразует декартовы координаты в сферические координаты.

source: Computes the mean value of each list in epoch_stats.
ru: Вычисляет среднее значение каждого списка в epoch_stats.

source: Recursively traverses the epoch_stats dictionary and computes the mean value of each list using np.mean(). If a key does not contain a list, its value is returned as is.
ru: Рекурсивно обходит словарь epoch_stats и вычисляет среднее значение каждого списка, используя np.mean(). Если ключ не содержит список, его значение возвращается как есть.

source: A dictionary representing the mean value of each list in epoch_stats.
ru: Словарь, представляющий среднее значение каждого списка в epoch_stats.

source: Distributes the global batch size over the replicas.
ru: Распределяет глобальный размер пакета по репликам.

source: The global batch size.
ru: Глобальный размер пакета.

source: The number of replicas.
ru: Количество реплик.

source: A list of batch sizes for each replica.
ru: Список размеров пакетов для каждой реплики.

source: Examples
ru: Примеры

source: Flatten a nested dictionary with keys separated by `sep`.
ru: Преобразует в плоский вид вложенный словарь с ключами, разделенными `sep`.

source: A nested dictionary to flatten.
ru: Вложенный словарь для преобразования в плоский вид.

source: The string of parent key (used for recursion).
ru: Строка родительского ключа (используется для рекурсии).

source: The separator to use between keys in the flattened dictionary.
ru: Разделитель для использования между ключами в преобразованном словаре.

source: A flattened dictionary with keys separated by `sep`.
ru: Преобразованный словарь с ключами, разделенными `sep`.

source: Gets the local batch size on the given rank in the global batch.
ru: Получает локальный размер пакета на заданном ранге в глобальном пакете.

source: The rank of the replica.
ru: Ранг реплики.

source: The local batch size on the given rank in the global batch.
ru: Локальный размер пакета на заданном ранге в глобальном пакете.

source: Gets the start and end indices of the local batch on the given rank in the global batch.
ru: Получает начальный и конечный индексы локального пакета на заданном ранге в глобальном пакете.

source: A list of tuples containing the start and end indices of the local batch in the global batch.
ru: Список кортежей, содержащих начальный и конечный индексы локального пакета в глобальном пакете.

source: A list of tuples containing the start and end indices
ru: Список кортежей, содержащих начальный и конечный индексы

source: of the local batch in the global batch.
ru: локального пакета в глобальном пакете.

source: Checks whether the given value `e` is in sorted array.
ru: Проверяет, находится ли заданное значение `e` в отсортированном массиве.

source: Code adopted from repository: https://github.com/jac99/MinkLocMultimodal, MIT License
ru: Код взят из репозитория: https://github.com/jac99/MinkLocMultimodal, MIT License

source: Value to search for.
ru: Значение для поиска.

source: Sorted array to look from.
ru: Отсортированный массив для поиска.

source: Whether the given value `e` is in sorted `array`.
ru: Находится ли заданное значение `e` в отсортированном `array`.

source: Transfers the model to the device, loads the weights and sets the model to eval mode.
ru: Переносит модель на устройство, загружает веса и устанавливает модель в режим eval.

source: Model.
ru: Модель.

source: Path to the model weights. If None, the weights are not loaded.
ru: Путь к весам модели. Если None, веса не загружаются.

source: Device to use.
ru: Устройство для использования.

source: Model in eval mode.
ru: Модель в режиме eval.

source: Recursively merge two nested dictionaries that have overlapping outer keys.
ru: Рекурсивно объединяет два вложенных словаря, имеющих перекрывающиеся внешние ключи.

source: First dictionary object.
ru: Первый объект словаря.

source: Second dictionary object.
ru: Второй объект словаря.

source: Merged dictionary.
ru: Объединенный словарь.

source: Parse given device argument and return torch.device object.
ru: Разбирает заданный аргумент устройства и возвращает объект torch.device.

source: Device argument.
ru: Аргумент устройства.

source: Device object.
ru: Объект устройства.

source: If device is not a string, integer or torch.device object.
ru: Если устройство не является строкой, целым числом или объектом torch.device.

source: Set the random seed for the `random`, `numpy`, and `torch` libraries and enables deterministic mode.
ru: Устанавливает случайное начальное число для библиотек `random`, `numpy` и `torch` и включает детерминированный режим.

source: The random seed to use. Defaults to 0.
ru: Случайное начальное число для использования. По умолчанию 0.

source: Whether to make PyTorch deterministic. If True, disables PyTorch's benchmark mode and enables its deterministic mode. If False, leaves PyTorch's settings unchanged. Defaults to True.
ru: Следует ли сделать PyTorch детерминированным. Если True, отключает режим benchmark PyTorch и включает его детерминированный режим. Если False, оставляет настройки PyTorch без изменений. По умолчанию True.
