Repository: OPR-Project/OpenPlaceRecognition
Catalog: docs/source/locale/*/LC_MESSAGES/api/opr.pipelines.registration.po
Languages: ru

source: opr.pipelines.registration package
ru: Пакет opr.pipelines.registration

source: Registration pipelines.
ru: Пайплайны регистрации.

source: Pointcloud registration pipeline.
ru: Пайплайн регистрации облака точек.

source: Bases: :py:class:`object`
ru: Основы: :py:class:`object`

source: Infer the transformation between the query and the database pointclouds.
ru: Вывод преобразования между query и database облаками точек.

source: Parameters
ru: Параметры

source: Query pointcloud. Coordinates array of shape (N, 3).
ru: Query облако точек. Массив координат формы (N, 3).

source: Database pointcloud. Coordinates array of shape (M, 3). If None, `db_pc_feats` must be provided. Defaults to None.
ru: Database облако точек. Массив координат формы (M, 3). Если None, должен быть предоставлен `db_pc_feats`. По умолчанию None.

source: Database pointcloud features. If None, `db_pc` must be provided. Defaults to None.
ru: Database признаки облака точек. Если None, должен быть предоставлен `db_pc`. По умолчанию None.

source: Returns
ru: Возвращает

source: Transformation matrix.
ru: Матрица преобразования.

source: Return type
ru: Тип возвращаемого значения

source: Raises
ru: Вызывает

source: If both `db_pc` and `db_pc_feats` are provided or if none of them are provided.
ru: Если предоставлены и `db_pc`, и `db_pc_feats`, или если ни один из них не предоставлен.

source: Pointcloud registration pipeline using RANSAC.
ru: Пайплайн регистрации облака точек с использованием RANSAC.

source: Database pointcloud. Coordinates array of shape (M, 3).
ru: Database облако точек. Массив координат формы (M, 3).

source: Bases: :py:class:`~opr.pipelines.registration.pointcloud.PointcloudRegistrationPipeline`
ru: Основы: :py:class:`~opr.pipelines.registration.pointcloud.PointcloudRegistrationPipeline`

source: Pointcloud registration pipeline that supports sequences.
ru: Пайплайн регистрации облака точек, поддерживающий последовательности.

source: List of query pointclouds. Each pointcloud is a coordinates array of shape (N, 3).
ru: Список query облаков точек. Каждое облако точек - это массив координат формы (N, 3).
