Repository: OPR-Project/OpenPlaceRecognition
Catalog: docs/source/locale/*/LC_MESSAGES/api/opr.datasets.po
Languages: ru

source: opr.datasets package
ru: opr.datasets пакет

source: Module for datasets.
ru: Модуль для наборов данных.

source: Data augmentation pipelines.
ru: Конвейеры расширения данных.

source: Point cloud augmentations adopted from the repository: https://github.com/jac99/MinkLocMultimodal, MIT License
ru: Аугментации облака точек, взятые из репозитория: https://github.com/jac99/MinkLocMultimodal, MIT License

source: Bases: :py:class:`object`
ru: Основы: :py:class:`object`

source: Default point cloud set augmentation pipeline.
ru: Конвейер расширения набора облаков точек по умолчанию.

source: Default point cloud augmentation pipeline.
ru: Конвейер расширения облака точек по умолчанию.

source: Default image augmentation pipeline.
ru: Конвейер расширения изображений по умолчанию.

source: Default semantic mask augmentation pipeline.
ru: Конвейер расширения семантической маски по умолчанию.

source: Rotate by one of the given angles.
ru: Повернуть на один из заданных углов.

source: One-Hot semantic mask augmentation pipeline.
ru: Конвейер расширения семантической маски One-Hot.

source: Randomly remove part of the point cloud. Similar to PyTorch RandomErasing but operating on 3D point clouds. Erases fronto-parallel cuboid. Instead of erasing we set coords of removed points to (0, 0, 0) to retain the same number of points
ru: Случайным образом удалить часть облака точек. Аналогично PyTorch RandomErasing, но работает с 3D облаками точек. Удаляет фронто-параллельный кубоид. Вместо удаления мы устанавливаем координаты удаленных точек в (0, 0, 0), чтобы сохранить то же количество точек

source: Base dataset implementation.
ru: Реализация базового набора данных.

source: Bases: :py:class:`~torch.utils.data.dataset.Dataset`
ru: Основы: :py:class:`~torch.utils.data.dataset.Dataset`

source: Base class for track-based Place Recognition dataset.
ru: Базовый класс для набора данных распознавания мест на основе треков.

source: Collate function for torch.utils.data.DataLoader.
ru: Функция объединения для torch.utils.data.DataLoader.

source: Boolean mask of negative samples for each element in the dataset.
ru: Булева маска отрицательных образцов для каждого элемента в наборе данных.

source: List of indexes of non-negatives samples for each element in the dataset.
ru: Список индексов неотрицательных образцов для каждого элемента в наборе данных.

source: List of indexes of positive samples for each element in the dataset.
ru: Список индексов положительных образцов для каждого элемента в наборе данных.

source: Boolean mask of positive samples for each element in the dataset.
ru: Булева маска положительных образцов для каждого элемента в наборе данных.

source: Functions to create PyTorch DataLoaders for different datasets.
ru: Функции для создания PyTorch DataLoaders для разных наборов данных.

source: Function to create DataLoader objects from given dataset and sampler configs.
ru: Функция для создания объектов DataLoader из заданного набора данных и конфигураций выборки.

source: Parameters
ru: Параметры

source: Dataset configuration.
ru: Конфигурация набора данных.

source: Batch sampler configuration.
ru: Конфигурация пакетного выборщика.

source: Number of workers for DataLoader. Defaults to 0.
ru: Количество рабочих для DataLoader. По умолчанию 0.

source: Returns
ru: Возвращает

source: Dictionary with DataLoaders.
ru: Словарь с DataLoaders.

source: Return type
ru: Тип возвращаемого значения

source: HM3D dataset implementation.
ru: Реализация набора данных HM3D.

source: Bases: :py:class:`~opr.datasets.base.BasePlaceRecognitionDataset`
ru: Основы: :py:class:`~opr.datasets.base.BasePlaceRecognitionDataset`

source: Pack input data list into batch.
ru: Упаковать список входных данных в пакет.

source: batch data list generated by DataLoader.
ru: список пакетных данных, сгенерированный DataLoader.

source: dictionary of batched data.
ru: словарь пакетных данных.

source: Custom ITLP-Campus dataset implementations.
ru: Пользовательские реализации набора данных ITLP-Campus.

source: ITLP Campus dataset implementation.
ru: Реализация набора данных ITLP Campus.

source: Augment the coordinates with a random normal distribution.
ru: Дополнить координаты случайным нормальным распределением.

source: The coordinates to be augmented.
ru: Координаты для дополнения.

source: The mean of the normal distribution. Defaults to (0.0, 0.0, 0.0).
ru: Среднее значение нормального распределения. По умолчанию (0.0, 0.0, 0.0).

source: The standard deviation of the normal distribution. Defaults to (1.0, 1.0, 1.0).
ru: Стандартное отклонение нормального распределения. По умолчанию (1.0, 1.0, 1.0).

source: The augmented coordinates.
ru: Дополненные координаты.

source: Augment the coordinates with a random rotation - all objects are rotated by the same, random uniformly distributed angle.
ru: Дополнить координаты случайным вращением - все объекты вращаются на один и тот же случайный равномерно распределенный угол.

source: The range of the random rotation angle. Defaults to (-np.pi, np.pi).
ru: Диапазон случайного угла поворота. По умолчанию (-np.pi, np.pi).

source: Download ITLP-Campus dataset tracks.
ru: Загрузить треки набора данных ITLP-Campus.

source: Output directory for downloaded tracks.
ru: Выходной каталог для загруженных треков.

source: NCLT dataset implementation.
ru: Реализация набора данных NCLT.

source: PointNetVLAD Oxford RobotCar dataset implementation.
ru: Реализация набора данных PointNetVLAD Oxford RobotCar.

source: Projection of pointcloud to camera image plane.
ru: Проекция облака точек на плоскость изображения камеры.

source: Adjust 3D LiDAR points projected onto the image plane to correspond to the new image after center cropping and resizing.
ru: Настроить 3D точки LiDAR, спроецированные на плоскость изображения, чтобы соответствовать новому изображению после центральной обрезки и изменения размера.

source: Parameters: - projected_points: np.ndarray of shape (N, 2) representing the 2D points on the original image. - center_crop_size: Tuple (W_c, H_c) representing the width and height of the crop. - resize_size: Tuple (W_r, H_r) representing the width and height of the resized image. - original_size: Tuple (W, H) representing the width and height of the original image.
ru: Параметры: - projected_points: np.ndarray формы (N, 2), представляющий 2D точки на исходном изображении. - center_crop_size: кортеж (W_c, H_c), представляющий ширину и высоту обрезки. - resize_size: кортеж (W_r, H_r), представляющий ширину и высоту измененного изображения. - original_size: кортеж (W, H), представляющий ширину и высоту исходного изображения.

source: Returns: - adjusted_points: np.ndarray of shape (N, 2) representing the adjusted 2D points on the resized image.
ru: Возвращает: - adjusted_points: np.ndarray формы (N, 2), представляющий настроенные 2D точки на измененном изображении.

source: Class for projecting pointcloud to camera image plane.
ru: Класс для проецирования облака точек на плоскость изображения камеры.

source: Build rotation matrix from quaternion.
ru: Построить матрицу вращения из кватерниона.

source: x coordinate
ru: координата x

source: y coordinate
ru: координата y

source: z coordinate
ru: координата z

source: quaternion
ru: кватернион

source: rotation matrix
ru: матрица вращения

source: Project pointcloud to camera image plane.
ru: Проецировать облако точек на плоскость изображения камеры.

source: pointcloud to project
ru: облако точек для проецирования

source: whether to return mask. Defaults to True.
ru: возвращать ли маску. По умолчанию True.

source: if return_mask: (uv, depths, in_image) else: (uv, depths)
ru: если return_mask: (uv, depths, in_image) иначе: (uv, depths)

source: Raises
ru: Вызывает

source: if wrong shape of points array
ru: если неправильная форма массива точек

source: Utility functions for Semantic-Object-Context modality.
ru: Вспомогательные функции для модальности Semantic-Object-Context.

source: Convert cylindrical coordinates to euclidean.
ru: Преобразовать цилиндрические координаты в евклидовы.

source: array of cylindrical coordinates with shape (n, 3).
ru: массив цилиндрических координат формы (n, 3).

source: array of euclidean coordinates with shape (n, 3).
ru: массив евклидовых координат формы (n, 3).

source: Convert euclidean coordinates to cylindrical.
ru: Преобразовать евклидовы координаты в цилиндрические.

source: array of 3D coordinates with shape (n, 3).
ru: массив 3D координат формы (n, 3).

source: whether to return 2D cylindrical coordinates. Defaults to False.
ru: возвращать ли 2D цилиндрические координаты. По умолчанию False.

source: array of cylindrical coordinates with shape (n, 3) or (n, 2) if to_2d is True.
ru: массив цилиндрических координат формы (n, 3) или (n, 2), если to_2d имеет значение True.

source: Convert euclidean coordinates to spherical.
ru: Преобразовать евклидовы координаты в сферические.

source: array of spherical coordinates with shape (n, 3).
ru: массив сферических координат формы (n, 3).

source: Generate color sequence.
ru: Создать цветовую последовательность.

source: number of colors to generate
ru: количество цветов для создания

source: palette to use. Defaults to "husl".
ru: используемая палитра. По умолчанию "husl".

source: list of colors in RGB format.
ru: список цветов в формате RGB.

source: Get point labels from semantic mask.
ru: Получить метки точек из семантической маски.

source: array of 2D coordinates of projected points with shape (n, 2).
ru: массив 2D координат спроецированных точек формы (n, 2).

source: semantic mask in opencv image format (ndarray)
ru: семантическая маска в формате изображения opencv (ndarray)

source: point labels taken from the mask.
ru: метки точек, взятые из маски.

source: Get objects from instance masks.
ru: Получить объекты из масок экземпляров.

source: dict of instances with keys as instance labels and values as instance masks.
ru: словарь экземпляров с ключами в качестве меток экземпляров и значениями в качестве масок экземпляров.

source: 2d points of pointcloud projected to image plane
ru: 2D точки облака точек, спроецированные на плоскость изображения

source: labels of points
ru: метки точек

source: 3d points of pointcloud
ru: 3D точки облака точек

source: dict of objects with keys as object labels and values as object properties.
ru: словарь объектов с ключами в качестве меток объектов и значениями в качестве свойств объектов.

source: Pack objects into a single array.
ru: Упаковать объекты в один массив.

source: maximum number of each class objects to pack
ru: максимальное количество объектов каждого класса для упаковки

source: maximum distance between objects
ru: максимальное расстояние между объектами

source: list of special classes to pack
ru: список специальных классов для упаковки

source: array of packed objects with shape (N, K, 3), where N - number of classes, K - number of objects of each class, 3 - 3DoF coords.
ru: массив упакованных объектов формы (N, K, 3), где N - количество классов, K - количество объектов каждого класса, 3 - 3DoF координаты.

source: Get instance labels from semantic mask.
ru: Получить метки экземпляров из семантической маски.

source: Instances are defined as connected components of the same class. Connected components found using opencv connectedComponentsWithStats opencv algorithm in class-wise manner.
ru: Экземпляры определяются как связные компоненты одного и того же класса. Связные компоненты найдены с использованием opencv connectedComponentsWithStats алгоритма opencv класс-за-классом.

source: minimum area of instance to be considered. Defaults to 10.
ru: минимальная площадь экземпляра для рассмотрения. По умолчанию 10.

source: list of labels to consider. Defaults to None.
ru: список меток для рассмотрения. По умолчанию None.

source: Convert spherical coordinates to euclidean.
ru: Преобразовать сферические координаты в евклидовы.
