Repository: OPR-Project/OpenPlaceRecognition
Catalog: docs/source/locale/*/LC_MESSAGES/api/opr.trainers.place_recognition.po
Languages: ru

source: opr.trainers.place\_recognition package
ru: Пакет opr.trainers.place\_recognition

source: Module for Place Recognition trainers.
ru: Модуль для тренеров Place Recognition.

source: Multimodal Place Recognition Trainer.
ru: Мультимодальный тренер Place Recognition.

source: Bases: :py:class:`~opr.trainers.place_recognition.unimodal.UnimodalPlaceRecognitionTrainer`
ru: Основы: :py:class:`~opr.trainers.place_recognition.unimodal.UnimodalPlaceRecognitionTrainer`

source: Pointcloud Place Recognition trainer.
ru: Тренер Pointcloud Place Recognition.

source: Bases: :py:class:`object`
ru: Основы: :py:class:`object`

source: Single modality Place Recognition trainer.
ru: Тренер Single modality Place Recognition.

source: Dictionary with statistics for the last epoch.
ru: Словарь со статистикой за последнюю эпоху.

source: Evaluates the model on the test set.
ru: Оценивает модель на тестовом наборе.

source: Parameters
ru: Параметры

source: The data loader for the test set.
ru: Загрузчик данных для тестового набора.

source: The distance threshold for a correct match. Defaults to 25.0.
ru: Порог расстояния для правильного соответствия. По умолчанию 25.0.

source: Trains the single modal Place Recognition model for the specified number of epochs.
ru: Обучает одномодальную модель Place Recognition в течение указанного количества эпох.

source: The number of epochs to train for.
ru: Количество эпох для обучения.

source: The data loader for the training set.
ru: Загрузчик данных для обучающего набора.

source: The data loader for the validation set.
ru: Загрузчик данных для проверочного набора.

source: The frequency (in epochs) at which to evaluate the model on the test set.
ru: Частота (в эпохах), с которой следует оценивать модель на тестовом наборе.
