Repository: OPR-Project/OpenPlaceRecognition
Catalog: docs/source/locale/*/LC_MESSAGES/api/opr.modules.po
Languages: ru

source: opr.modules package
ru: Пакет opr.modules

source: Building blocks for the OPR modular system.
ru: Строительные блоки для модульной системы OPR.

source: CosPlace aggregation layer implementation.
ru: Реализация агрегирующего слоя CosPlace.

source: Bases: :py:class:`~torch.nn.modules.module.Module`
ru: Основы: :py:class:`~torch.nn.modules.module.Module`

source: CosPlace aggregation layer.
ru: Агрегирующий слой CosPlace.

source: As implemented in https://github.com/gmberton/CosPlace/blob/main/model/network.py
ru: Как реализовано в https://github.com/gmberton/CosPlace/blob/main/model/network.py

source: Defines the computation performed at every call.
ru: Определяет вычисление, выполняемое при каждом вызове.

source: Should be overridden by all subclasses.
ru: Должен быть переопределен всеми подклассами.

source: Although the recipe for forward pass needs to be defined within this function, one should call the :class:`Module` instance afterwards instead of this since the former takes care of running the registered hooks while the latter silently ignores them.
ru: Хотя рецепт для прямого прохода должен быть определен внутри этой функции, следует вызывать экземпляр :class:`Module` после этого, поскольку первый заботится о запуске зарегистрированных хуков, а второй молча игнорирует их.

source: Cross-Attention layer for 2 image descriptors.
ru: Слой Cross-Attention для 2 дескрипторов изображений.

source: Works in a strange way - for 2 embeddings only. Computes cross-attention scores between those embeddings and return 'cross-attentioned' values.
ru: Работает странным образом - только для 2 embeddings. Вычисляет оценки cross-attention между этими embeddings и возвращает значения 'cross-attentioned'.

source: TODO: should be re-thinkend.
ru: TODO: следует переосмыслить.

source: inputs :
ru: входы :

source: data : dict with 2 image descriptors that needs to be cross-attentioned
ru: data: словарь с 2 дескрипторами изображений, которые необходимо cross-attentioned

source: returns :
ru: возвращает :

source: out : cross attention value + input feature
ru: out: значение cross attention + входной признак

source: Cross-Attention layer for images
ru: Слой Cross-Attention для изображений

source: im1 : input image1 descriptors ( B x C ) im2 : input image2 descriptors ( B x C )
ru: im1: дескрипторы входного изображения 1 (B x C) im2: дескрипторы входного изображения 2 (B x C)

source: Implementation of Efficient Channel Attention ECA block.
ru: Реализация блока Efficient Channel Attention ECA.

source: Wang, Qilong, et al. "ECA-Net: Efficient channel attention for deep convolutional neural networks." Proceedings of the IEEE/CVF conference on computer vision and pattern recognition. 2020.
ru: Wang, Qilong, et al. "ECA-Net: Efficient channel attention for deep convolutional neural networks." Материалы конференции IEEE/CVF по компьютерному зрению и распознаванию образов. 2020.

source: Paper: https://arxiv.org/abs/1910.03151 Code for Mink version adopted from the repository: https://github.com/jac99/MinkLoc3Dv2, MIT License
ru: Статья: https://arxiv.org/abs/1910.03151 Код для версии Mink взят из репозитория: https://github.com/jac99/MinkLoc3Dv2, MIT License

source: Bases: :py:class:`~MinkowskiEngine.modules.resnet_block.BasicBlock`
ru: Основы: :py:class:`~MinkowskiEngine.modules.resnet_block.BasicBlock`

source: Efficient Channel Attention BasicBlock for ResNet with MinkowskiEngine.
ru: Efficient Channel Attention BasicBlock для ResNet с MinkowskiEngine.

source: Efficient Channel Attention layer for sparse tensors with MinkowskiEngine.
ru: Efficient Channel Attention слой для разреженных тензоров с MinkowskiEngine.

source: Basic fusion modules implementation.
ru: Реализация базовых модулей fusion.

source: Addition module.
ru: Модуль сложения.

source: Concatenation module.
ru: Модуль конкатенации.

source: GeM fusion module.
ru: Модуль GeM fusion.

source: Generalized-Mean pooling layer implementation.
ru: Реализация слоя Generalized-Mean pooling.

source: Radenović, Filip, Giorgos Tolias, and Ondřej Chum. "Fine-tuning CNN image retrieval with no human annotation." IEEE transactions on pattern analysis and machine intelligence 41.7 (2018): 1655-1668.
ru: Radenović, Filip, Giorgos Tolias и Ondřej Chum. "Fine-tuning CNN image retrieval with no human annotation." IEEE transactions on pattern analysis and machine intelligence 41.7 (2018): 1655-1668.

source: Paper: https://arxiv.org/abs/1711.02512 Code adopted from the repository: https://github.com/jac99/MinkLocMultimodal, MIT License
ru: Статья: https://arxiv.org/abs/1711.02512 Код взят из репозитория: https://github.com/jac99/MinkLocMultimodal, MIT License

source: GeM pooling layer.
ru: Слой GeM pooling.

source: GeM pooling layer for sparse tensors with MinkowskiEngine.
ru: Слой GeM pooling для разреженных тензоров с MinkowskiEngine.

source: Bases: :py:class:`~opr.modules.gem.GeM`
ru: Основы: :py:class:`~opr.modules.gem.GeM`

source: 1D GeM pooling layer.
ru: 1D слой GeM pooling.

source: MixVPR: Feature Mixing for Visual Place Recognition.
ru: MixVPR: Feature Mixing для визуального распознавания мест.

source: Source: https://github.com/amaralibey/MixVPR/blob/main/models/aggregators/mixvpr.py
ru: Источник: https://github.com/amaralibey/MixVPR/blob/main/models/aggregators/mixvpr.py

source: Feature Mixer Layer.
ru: Слой Feature Mixer.

source: MixVPR aggregation layer.
ru: Агрегирующий слой MixVPR.

source: 2-layer MLP module implementation.
ru: Реализация 2-слойного модуля MLP.

source: MLP as used in Vision Transformer, MLP-Mixer and related networks.
ru: MLP, используемый в Vision Transformer, MLP-Mixer и связанных сетях.

source: NetVLAD layer implementation.
ru: Реализация слоя NetVLAD.

source: Initialize NetVLAD layer parameters.
ru: Инициализация параметров слоя NetVLAD.

source: Self-attention modules.
ru: Модули self-attention.

source: Self-attention module.
ru: Модуль self-attention.

source: Implementation of ASVT and CSVT modules.
ru: Реализация модулей ASVT и CSVT.

source: Citation:
ru: Цитата:

source: Fan, Zhaoxin, et al. "Svt-net: Super light-weight sparse voxel transformer for large scale place recognition." Proceedings of the AAAI Conference on Artificial Intelligence. Vol. 36. No. 1. 2022.
ru: Fan, Zhaoxin, et al. "Svt-net: Super light-weight sparse voxel transformer for large scale place recognition." Материалы конференции AAAI по искусственному интеллекту. Том 36. № 1. 2022.

source: Source: https://github.com/ZhenboSong/SVTNet Paper: https://arxiv.org/abs/2105.00149
ru: Источник: https://github.com/ZhenboSong/SVTNet Статья: https://arxiv.org/abs/2105.00149
