Repository: OPR-Project/OpenPlaceRecognition
Catalog: docs/source/locale/*/LC_MESSAGES/api/opr.pipelines.localization.po
Languages: ru

source: opr.pipelines.localization package
ru: Пакет opr.pipelines.localization

source: Hierarchical localization pipelines.
ru: Пайплайны иерархической локализации.

source: ArucoPlaceRecognitionPipeline pipeline.
ru: Пайплайн ArucoPlaceRecognitionPipeline.

source: Bases: :py:class:`~opr.pipelines.localization.base.LocalizationPipeline`
ru: Основы: :py:class:`~opr.pipelines.localization.base.LocalizationPipeline`

source: ArucoLocalizationPipeline pipeline.
ru: Пайплайн ArucoLocalizationPipeline.

source: Single aruco inference.
ru: Вывод для одного aruco.

source: Parameters
ru: Параметры

source: Input data. Dictionary with keys in the following format: "image_{camera_name}" for images from cameras, "mask_{camera_name}" for semantic segmentation masks, "pointcloud_lidar_coords" for pointcloud coordinates from lidar, "pointcloud_lidar_feats" for pointcloud features from lidar.
ru: Входные данные. Словарь с ключами в следующем формате: "image_{camera_name}" для изображений с камер, "mask_{camera_name}" для масок семантической сегментации, "pointcloud_lidar_coords" для координат облака точек с лидара, "pointcloud_lidar_feats" для признаков облака точек с лидара.

source: Input data. Dictionary with keys in the following format:
ru: Входные данные. Словарь с ключами в следующем формате:

source: "image_{camera_name}" for images from cameras,
ru: "image_{camera_name}" для изображений с камер,

source: "mask_{camera_name}" for semantic segmentation masks,
ru: "mask_{camera_name}" для масок семантической сегментации,

source: "pointcloud_lidar_coords" for pointcloud coordinates from lidar,
ru: "pointcloud_lidar_coords" для координат облака точек с лидара,

source: "pointcloud_lidar_feats" for pointcloud features from lidar.
ru: "pointcloud_lidar_feats" для признаков облака точек с лидара.

source: Returns
ru: Возвращает

source: predicted pose in the format [tx, ty, tz, qx, qy, qz, qw],
ru: предсказанная поза в формате [tx, ty, tz, qx, qy, qz, qw],

source: Return type
ru: Тип возвращаемого значения

source: Single sample inference.
ru: Вывод для одного образца.

source: Inference results. Dict with dictionaries: "pose_by_aruco": "pose" for predicted pose in the format [tx, ty, tz, qx, qy, qz, qw], "pose_by_place_recognition": "pose" for predicted pose in the format [tx, ty, tz, qx, qy, qz, qw].
ru: Результаты вывода. Словарь со словарями: "pose_by_aruco": "pose" для предсказанной позы в формате [tx, ty, tz, qx, qy, qz, qw], "pose_by_place_recognition": "pose" для предсказанной позы в формате [tx, ty, tz, qx, qy, qz, qw].

source: Inference results. Dict with dictionaries:
ru: Результаты вывода. Словарь со словарями:

source: "pose_by_aruco": "pose" for predicted pose in the format [tx, ty, tz, qx, qy, qz, qw],
ru: "pose_by_aruco": "pose" для предсказанной позы в формате [tx, ty, tz, qx, qy, qz, qw],

source: "pose_by_place_recognition": "pose" for predicted pose in the format [tx, ty, tz, qx, qy, qz, qw].
ru: "pose_by_place_recognition": "pose" для предсказанной позы в формате [tx, ty, tz, qx, qy, qz, qw].

source: Single localization inference.
ru: Вывод для одного этапа локализации.

source: From the 6D poses in the [tx ty tz qx qy qz qw] format to 4x4 pose matrices.
ru: Преобразование 6D поз в формате [tx ty tz qx qy qz qw] в матрицы позы 4x4.

source: Hierarchical Localization Pipeline.
ru: Пайплайн иерархической локализации.

source: Bases: :py:class:`object`
ru: Основы: :py:class:`object`

source: The task of localiation is solved in two steps: 1. Find the best match for the query in the database (Place Recognition). 2. Refine the pose estimate using the query and the database match (Registration).
ru: Задача локализации решается в два этапа: 1. Найти наилучшее соответствие для запроса в базе данных (Place Recognition). 2. Уточнить оценку позы, используя запрос и соответствие в базе данных (Registration).

source: Compute registration features for the database.
ru: Вычислить признаки регистрации для базы данных.

source: Directory to save the features.
ru: Каталог для сохранения признаков.

source: Directory where pointclouds will be saved.
ru: Каталог, в котором будут сохранены облака точек.

source: Inference results. Dictionary with keys: "db_match_pose" for database match pose in the format [tx, ty, tz, qx, qy, qz, qw], "estimated_pose" for estimated pose in the format [tx, ty, tz, qx, qy, qz, qw].
ru: Результаты вывода. Словарь с ключами: "db_match_pose" для позы соответствия в базе данных в формате [tx, ty, tz, qx, qy, qz, qw], "estimated_pose" для оцененной позы в формате [tx, ty, tz, qx, qy, qz, qw].

source: Inference results. Dictionary with keys:
ru: Результаты вывода. Словарь с ключами:

source: "db_match_pose" for database match pose in the format [tx, ty, tz, qx, qy, qz, qw],
ru: "db_match_pose" для позы соответствия в базе данных в формате [tx, ty, tz, qx, qy, qz, qw],

source: "estimated_pose" for estimated pose in the format [tx, ty, tz, qx, qy, qz, qw].
ru: "estimated_pose" для оцененной позы в формате [tx, ty, tz, qx, qy, qz, qw].

source: Raises
ru: Вызывает

source: Provided input data is a list, but the pipeline is not for sequences.
ru: Предоставленные входные данные являются списком, но пайплайн не предназначен для последовательностей.

source: Provided input data is not a list, but the pipeline is for sequences.
ru: Предоставленные входные данные не являются списком, но пайплайн предназначен для последовательностей.
