Repository: OPR-Project/OpenPlaceRecognition
Catalog: docs/source/locale/*/LC_MESSAGES/api/opr.models.registration.po
Languages: ru

source: opr.models.registration package
ru: Пакет opr.models.registration

source: Module for Registration models.
ru: Модуль для моделей регистрации.

source: GeoTransformer model for registration.
ru: Модель GeoTransformer для регистрации.

source: Paper: https://arxiv.org/abs/2202.06688
ru: Статья: https://arxiv.org/abs/2202.06688

source: Code is adopted from original repository: https://github.com/qinzheng93/GeoTransformer, MIT License
ru: Код взят из оригинального репозитория: https://github.com/qinzheng93/GeoTransformer, MIT License

source: Bases: :py:class:`~torch.nn.modules.module.Module`
ru: Основы: :py:class:`~torch.nn.modules.module.Module`

source: Defines the computation performed at every call.
ru: Определяет вычисление, выполняемое при каждом вызове.

source: Should be overridden by all subclasses.
ru: Должен быть переопределен всеми подклассами.

source: Although the recipe for forward pass needs to be defined within this function, one should call the :class:`Module` instance afterwards instead of this since the former takes care of running the registered hooks while the latter silently ignores them.
ru: Хотя рецепт для прямого прохода должен быть определен внутри этой функции, следует вызывать экземпляр :class:`Module` после этого, поскольку первый заботится о запуске зарегистрированных хуков, а второй молча игнорирует их.

source: Feature Pyramid Network with KPConv backbone.
ru: Feature Pyramid Network с KPConv backbone.

source: Implementation of HRegNet point cloud registration model.
ru: Реализация модели регистрации облака точек HRegNet.

source: Bases: :py:class:`~hregnet.models.HRegNet`
ru: Основы: :py:class:`~hregnet.models.HRegNet`

source: HRegNet: A Hierarchical Network for Large-scale Outdoor LiDAR Point Cloud Registration.
ru: HRegNet: Иерархическая сеть для крупномасштабной регистрации облаков точек LiDAR на открытом воздухе.

source: Paper: https://arxiv.org/abs/2107.11992 Code is adopted from the original repository: https://github.com/ispc-lab/HRegNet, MIT License
ru: Статья: https://arxiv.org/abs/2107.11992 Код взят из оригинального репозитория: https://github.com/ispc-lab/HRegNet, MIT License
