Repository: OPR-Project/OpenPlaceRecognition
Catalog: docs/source/locale/*/LC_MESSAGES/api/opr.samplers.po
Languages: ru

source: opr.samplers package
ru: Пакет opr.samplers

source: Module for samplers.
ru: Модуль для сэмплеров.

source: Batch sampler from MinkLoc method.
ru: Batch sampler из метода MinkLoc.

source: Code adopted from repository: https://github.com/jac99/MinkLocMultimodal, MIT License
ru: Код взят из репозитория: https://github.com/jac99/MinkLocMultimodal, MIT License

source: Bases: :py:class:`~torch.utils.data.sampler.Sampler`
ru: Основы: :py:class:`~torch.utils.data.sampler.Sampler`

source: Sampler returning list of indices to form a mini-batch.
ru: Сэмплер, возвращающий список индексов для формирования мини-пакета.

source: Samples elements in groups consisting of k=2 similar elements (positives) Batch has the following structure: item1_1, ..., item1_k, item2_1, ... item2_k, itemn_1, ..., itemn_k
ru: Выбирает элементы группами, состоящими из k=2 похожих элементов (положительных) Пакет имеет следующую структуру: item1_1, ..., item1_k, item2_1, ... item2_k, itemn_1, ..., itemn_k

source: Batch expansion method. See MinkLoc paper for details about dynamic batch sizing.
ru: Метод расширения батча. См. статью MinkLoc для получения подробной информации о динамическом размере батча.

source: Generate training/evaluation batches.
ru: Создание батчей для обучения/оценки.

source: Wrapper for BatchSampler that supports distributed batch sampling.
ru: Обертка для BatchSampler, поддерживающая распределенную выборку батчей.
