Repository: OPR-Project/OpenPlaceRecognition
Catalog: docs/source/locale/*/LC_MESSAGES/api/opr.miners.po
Languages: ru

source: opr.miners package
ru: opr.miners пакет

source: Module for miners.
ru: Модуль для майнеров.

source: Batch hard triplet miner implementation.
ru: Реализация Batch hard triplet miner.

source: Code adopted from repository: https://github.com/jac99/MinkLocMultimodal, MIT License
ru: Код взят из репозитория: https://github.com/jac99/MinkLocMultimodal, MIT License

source: Bases: :py:class:`~torch.nn.modules.module.Module`
ru: Основы: :py:class:`~torch.nn.modules.module.Module`

source: Original idea is taken from repository: https://github.com/jac99/MinkLocMultimodal, MIT License
ru: Оригинальная идея взята из репозитория: https://github.com/jac99/MinkLocMultimodal, MIT License

source: Mine hard triplets from given batch of embeddings. For each element in batch triplet will be mined.
ru: Извлечение сложных триплетов из заданного пакета вложений. Для каждого элемента в пакете будет извлечен триплет.

source: Parameters
ru: Параметры

source: Model output embeddings.
ru: Вложения вывода модели.

source: Binary mask of positive elements in batch.
ru: Двоичная маска положительных элементов в пакете.

source: Binary mask of negative elements in batch.
ru: Двоичная маска отрицательных элементов в пакете.

source: Returns
ru: Возвращает

source: Hard triplets tuple (a, p, n).
ru: Кортеж сложных триплетов (a, p, n).

source: Return type
ru: Тип возвращаемого значения

source: Return statistics of last forward pass.
ru: Возвращает статистику последнего прямого прохода.
