Repository: OPR-Project/OpenPlaceRecognition
Catalog: docs/source/locale/*/LC_MESSAGES/api/opr.losses.po
Languages: ru

source: opr.losses package
ru: opr.losses пакет

source: Module for losses.
ru: Модуль для функций потерь.

source: Multimodal contrastive loss implementation.
ru: Реализация мультимодальной контрастивной функции потерь.

source: Code adopted from repository: https://github.com/jac99/MinkLocMultimodal, MIT License
ru: Код взят из репозитория: https://github.com/jac99/MinkLocMultimodal, MIT License

source: Bases: :py:class:`~torch.nn.modules.module.Module`
ru: Основы: :py:class:`~torch.nn.modules.module.Module`

source: Contrastive loss with batch hard triplet miner.
ru: Контрастивная функция потерь с batch hard triplet miner.

source: Defines the computation performed at every call.
ru: Определяет вычисления, выполняемые при каждом вызове.

source: Should be overridden by all subclasses.
ru: Должен быть переопределен всеми подклассами.

source: Although the recipe for forward pass needs to be defined within this function, one should call the :class:`Module` instance afterwards instead of this since the former takes care of running the registered hooks while the latter silently ignores them.
ru: Хотя рецепт для прямого прохода должен быть определен внутри этой функции, следует вызывать экземпляр :class:`Module` после этого, поскольку первый заботится о запуске зарегистрированных хуков, а второй молча игнорирует их.

source: Multimodal triplet margin loss implementation.
ru: Реализация мультимодальной triplet margin функции потерь.

source: Triplet margin loss with batch hard triplet miner.
ru: Triplet margin функция потерь с batch hard triplet miner.

source: Implemented as per "Recall@k Surrogate Loss with Large Batches and Similarity Mixup" paper, but only the fixed number of the closest positives is considered.
ru: Реализовано в соответствии со статьей "Recall@k Surrogate Loss with Large Batches and Similarity Mixup", но учитывается только фиксированное количество ближайших положительных примеров.

source: Code adopted from repository https://github.com/jac99/MinkLoc3Dv2, MIT License
ru: Код взят из репозитория https://github.com/jac99/MinkLoc3Dv2, MIT License

source: computes the affinity matrix between an input vector and itself
ru: вычисляет матрицу аффинности между входным вектором и им самим

source: temperature controlled sigmoid takes as input a torch tensor (tensor) and passes it through a sigmoid, controlled by temperature: temp
ru: temperature controlled sigmoid принимает в качестве входных данных torch tensor (tensor) и пропускает его через сигмоиду, контролируемую температурой: temp
