Repository: OPR-Project/OpenPlaceRecognition
Catalog: docs/source/locale/*/LC_MESSAGES/api/opr.models.place_recognition.po
Languages: ru

source: opr.models.place\_recognition package
ru: opr.models.place\_recognition пакет

source: Module for Place Recognition models.
ru: Модуль для моделей распознавания мест.

source: Implementation of APGeM Image Model.
ru: Реализация APGeM Image Model.

source: Bases: :py:class:`~opr.models.place_recognition.base.ImageModel`
ru: Основы: :py:class:`~opr.models.place_recognition.base.ImageModel`

source: APGeM: 'Learning with Average Precision: Training Image Retrieval with a Listwise Loss'.
ru: APGeM: 'Обучение со средней точностью: обучение извлечению изображений с помощью поэлементной функции потерь'.

source: Paper: https://arxiv.org/abs/1906.07589
ru: Статья: https://arxiv.org/abs/1906.07589

source: Base meta-models for Place Recognition.
ru: Базовые мета-модели для распознавания мест.

source: Bases: :py:class:`~torch.nn.modules.module.Module`
ru: Основы: :py:class:`~torch.nn.modules.module.Module`

source: Meta-model for lidar-based Place Recognition. Combines feature extraction backbone and head modules.
ru: Мета-модель для распознавания мест на основе лидара. Объединяет извлечение признаков, магистральную сеть и модули заголовка.

source: Defines the computation performed at every call.
ru: Определяет вычисления, выполняемые при каждом вызове.

source: Should be overridden by all subclasses.
ru: Должен быть переопределен всеми подклассами.

source: Although the recipe for forward pass needs to be defined within this function, one should call the :class:`Module` instance afterwards instead of this since the former takes care of running the registered hooks while the latter silently ignores them.
ru: Хотя рецепт для прямого прохода должен быть определен внутри этой функции, следует вызывать экземпляр :class:`Module` после этого, поскольку первый заботится о запуске зарегистрированных хуков, а второй молча игнорирует их.

source: Meta-model for image-based Place Recognition. Combines feature extraction backbone and head modules.
ru: Мета-модель для распознавания мест на основе изображений. Объединяет извлечение признаков, магистральную сеть и модули заголовка.

source: Meta-model for multimodal Place Recognition architectures with late fusion.
ru: Мета-модель для мультимодальных архитектур распознавания мест с поздним слиянием.

source: Meta-model for semantic-based Place Recognition. Combines feature extraction backbone and head modules.
ru: Мета-модель для семантического распознавания мест. Объединяет извлечение признаков, магистральную сеть и модули заголовка.

source: Implementation of CosPlace model.
ru: Реализация модели CosPlace.

source: CosPlace: Rethinking Visual Geo-localization for Large-Scale Applications.
ru: CosPlace: переосмысление визуальной геолокализации для крупномасштабных приложений.

source: Paper: https://arxiv.org/abs/2204.02287
ru: Статья: https://arxiv.org/abs/2204.02287

source: Implementations of MinkLoc models.
ru: Реализации моделей MinkLoc.

source: Bases: :py:class:`~opr.models.place_recognition.base.CloudModel`
ru: Основы: :py:class:`~opr.models.place_recognition.base.CloudModel`

source: MinkLoc3D: Point Cloud Based Large-Scale Place Recognition.
ru: MinkLoc3D: Крупномасштабное распознавание мест на основе облака точек.

source: Paper: https://arxiv.org/abs/2011.04530 Code is adopted from the original repository: https://github.com/jac99/MinkLoc3Dv2, MIT License
ru: Статья: https://arxiv.org/abs/2011.04530 Код взят из оригинального репозитория: https://github.com/jac99/MinkLoc3Dv2, MIT License

source: Bases: :py:class:`~opr.models.place_recognition.minkloc.MinkLoc3D`
ru: Основы: :py:class:`~opr.models.place_recognition.minkloc.MinkLoc3D`

source: Improving Point Cloud Based Place Recognition with Ranking-based Loss and Large Batch Training.
ru: Улучшение распознавания мест на основе облака точек с помощью функции потерь на основе ранжирования и обучения на больших пакетах.

source: Paper: https://arxiv.org/abs/2203.00972 Code is adopted from the original repository: https://github.com/jac99/MinkLoc3Dv2, MIT License
ru: Статья: https://arxiv.org/abs/2203.00972 Код взят из оригинального репозитория: https://github.com/jac99/MinkLoc3Dv2, MIT License

source: Bases: :py:class:`~opr.models.place_recognition.base.LateFusionModel`
ru: Основы: :py:class:`~opr.models.place_recognition.base.LateFusionModel`

source: MinkLoc++: Lidar and Monocular Image Fusion for Place Recognition.
ru: MinkLoc++: Слияние лидара и монокулярных изображений для распознавания мест.

source: Paper: https://arxiv.org/pdf/2104.05327.pdf Code is adopted from the original repository: https://github.com/jac99/MinkLocMultimodal, MIT License
ru: Статья: https://arxiv.org/pdf/2104.05327.pdf Код взят из оригинального репозитория: https://github.com/jac99/MinkLocMultimodal, MIT License

source: Implementation of NetVLAD model.
ru: Реализация модели NetVLAD.

source: NetVLAD: CNN architecture for weakly supervised place recognition.
ru: NetVLAD: Архитектура CNN для слабо контролируемого распознавания мест.

source: Paper: https://arxiv.org/abs/1511.07247v3 Code is adopted from the repository: https://github.com/Nanne/pytorch-NetVlad
ru: Статья: https://arxiv.org/abs/1511.07247v3 Код взят из репозитория: https://github.com/Nanne/pytorch-NetVlad

source: Implementation of OverlapTransformer model.
ru: Реализация модели OverlapTransformer.

source: OverlapTransformer: An Efficient and Yaw-Angle-Invariant Transformer Network for LiDAR-Based Place Recognition.
ru: OverlapTransformer: Эффективная и инвариантная к углу рыскания сеть трансформеров для распознавания мест на основе лидара.

source: Paper: https://arxiv.org/abs/2203.03397 Adapted from original repository: https://github.com/haomo-ai/OverlapTransformer
ru: Статья: https://arxiv.org/abs/2203.03397 Адаптировано из оригинального репозитория: https://github.com/haomo-ai/OverlapTransformer

source: MHSA num_layers=1 is suggested in our work.
ru: В нашей работе предлагается MHSA num_layers=1.

source: Implementation of PatchNetVLAD model.
ru: Реализация модели PatchNetVLAD.

source: Patch-NetVLAD: Multi-Scale Fusion of Locally-Global Descriptors for Place Recognition.
ru: Patch-NetVLAD: Мультимасштабное слияние локально-глобальных дескрипторов для распознавания мест.

source: Paper: https://arxiv.org/abs/2103.01486 Code is adopted from original repository: https://github.com/QVPR/Patch-NetVLAD
ru: Статья: https://arxiv.org/abs/2103.01486 Код взят из оригинального репозитория: https://github.com/QVPR/Patch-NetVLAD

source: Initialize NetVLAD layer parameters.
ru: Инициализация параметров слоя NetVLAD.

source: Input/Output as [N,D,H,W] where N is batch size and D is descriptor dimensions For VLAD, D = K x d where K is the number of clusters and d is the original descriptor dimensions
ru: Вход/Выход как [N,D,H,W], где N - размер пакета, а D - размерность дескриптора. Для VLAD, D = K x d, где K - количество кластеров, а d - исходная размерность дескриптора

source: Input as [N,D,H+1,W+1] where additional 1s for last two axes are zero paddings regSize and regStride are single values as only square regions are implemented currently
ru: Вход как [N,D,H+1,W+1], где дополнительные 1 для последних двух осей являются нулевыми заполнениями. regSize и regStride - это отдельные значения, так как в настоящее время реализованы только квадратные области

source: Implementation of PointNetVLAD model.
ru: Реализация модели PointNetVLAD.

source: Flatten layer.
ru: Слой Flatten.

source: Gating context layer.
ru: Слой контекста стробирования.

source: NetVLAD aggregation layer with gating mechanism.
ru: Слой агрегации NetVLAD с механизмом стробирования.

source: PointNet feature extractor.
ru: Извлекатель признаков PointNet.

source: PointNetVLAD: Deep Point Cloud Based Retrieval for Large-Scale Place Recognition.
ru: PointNetVLAD: Глубокое извлечение на основе облака точек для крупномасштабного распознавания мест.

source: Paper: https://arxiv.org/abs/1804.03492 Original repository: https://github.com/mikacuy/pointnetvlad Code is adopted from repository: https://github.com/cattaneod/PointNetVlad-Pytorch
ru: Статья: https://arxiv.org/abs/1804.03492 Оригинальный репозиторий: https://github.com/mikacuy/pointnetvlad Код взят из репозитория: https://github.com/cattaneod/PointNetVlad-Pytorch

source: Spatial Transformer Network for 3D data.
ru: Сеть пространственного преобразования для 3D данных.

source: ResNet image models for Place Recognition.
ru: Модели изображений ResNet для распознавания мест.

source: ResNet18 image model for Place Recognition.
ru: Модель изображений ResNet18 для распознавания мест.

source: Bases: :py:class:`~opr.models.place_recognition.base.SemanticModel`
ru: Основы: :py:class:`~opr.models.place_recognition.base.SemanticModel`

source: ResNet18 semantic mask model for Place Recognition.
ru: Модель семантической маски ResNet18 для распознавания мест.

source: Semantic-Object-Context modality model.
ru: Модель модальности Semantic-Object-Context.

source: Bases: :py:class:`~opr.models.place_recognition.soc.SOCModel`
ru: Основы: :py:class:`~opr.models.place_recognition.soc.SOCModel`

source: Forward pass.
ru: Прямой проход.

source: Parameters
ru: Параметры

source: input batch
ru: входной пакет

source: Returns
ru: Возвращает

source: output tensor of shape (batch_size, embeddings_size)
ru: выходной тензор формы (batch_size, embeddings_size)

source: Return type
ru: Тип возвращаемого значения

source: Semantic-Object-Context modality model based on MLP Mixer .
ru: Модель модальности Semantic-Object-Context на основе MLP Mixer.

source: Kind of Attention-layer build on top of MLPs. Original paper: https://arxiv.org/abs/2105.01601 implementation: https://github.com/lucidrains/mlp-mixer-pytorch
ru: Тип слоя внимания, построенного на основе MLP. Оригинальная статья: https://arxiv.org/abs/2105.01601 реализация: https://github.com/lucidrains/mlp-mixer-pytorch

source: output dictionary with "final_descriptor" key containing the output tensor
ru: выходной словарь с ключом "final_descriptor", содержащим выходной тензор

source: Semantic-Object-Context modality base model class.
ru: Базовый класс модели модальности Semantic-Object-Context.

source: output dictionary
ru: выходной словарь

source: SVT-Net: Super Light-Weight Sparse Voxel Transformer for Large Scale Place Recognition.
ru: SVT-Net: Сверхлегкий разреженный воксельный трансформер для крупномасштабного распознавания мест.

source: Citation:
ru: Цитата:

source: Fan, Zhaoxin, et al. "Svt-net: Super light-weight sparse voxel transformer for large scale place recognition." Proceedings of the AAAI Conference on Artificial Intelligence. Vol. 36. No. 1. 2022.
ru: Fan, Zhaoxin, et al. "Svt-net: Сверхлегкий разреженный воксельный трансформер для крупномасштабного распознавания мест." Материалы конференции AAAI по искусственному интеллекту. Том 36. № 1. 2022.

source: Source: https://github.com/ZhenboSong/SVTNet Paper: https://arxiv.org/abs/2105.00149
ru: Источник: https://github.com/ZhenboSong/SVTNet Статья: https://arxiv.org/abs/2105.00149
