Repository: OPR-Project/OpenPlaceRecognition
Catalog: docs/source/locale/*/LC_MESSAGES/api/opr.modules.feature_extractors.po
Languages: ru

source: opr.modules.feature\_extractors package
ru: Пакет opr.modules.feature\_extractors

source: Feature extraction modules.
ru: Модули извлечения признаков.

source: ConvNeXt-based image feature extractors.
ru: Модули извлечения признаков изображений на основе ConvNeXt.

source: Bases: :py:class:`~torch.nn.modules.module.Module`
ru: Основы: :py:class:`~torch.nn.modules.module.Module`

source: ConvNeXt-Tiny image feature extractor.
ru: Модуль извлечения признаков изображений ConvNeXt-Tiny.

source: Defines the computation performed at every call.
ru: Определяет вычисление, выполняемое при каждом вызове.

source: Should be overridden by all subclasses.
ru: Должен быть переопределен всеми подклассами.

source: Although the recipe for forward pass needs to be defined within this function, one should call the :class:`Module` instance afterwards instead of this since the former takes care of running the registered hooks while the latter silently ignores them.
ru: Хотя рецепт для прямого прохода должен быть определен внутри этой функции, следует вызывать экземпляр :class:`Module` после этого, поскольку первый заботится о запуске зарегистрированных хуков, а второй молча игнорирует их.

source: ResNetFPN feature extraction module implemented with MinkowskiEngine.
ru: Модуль извлечения признаков ResNetFPN, реализованный с помощью MinkowskiEngine.

source: Komorowski, Jacek. "Minkloc3d: Point cloud based large-scale place recognition." Proceedings of the IEEE/CVF Winter Conference on Applications of Computer Vision. 2021.
ru: Komorowski, Jacek. "Minkloc3d: Point cloud based large-scale place recognition." Материалы Зимней конференции IEEE/CVF по приложениям компьютерного зрения. 2021.

source: Paper: https://arxiv.org/abs/2011.04530 Code is adopted from the original repository: https://github.com/jac99/MinkLoc3Dv2, MIT License
ru: Статья: https://arxiv.org/abs/2011.04530 Код взят из оригинального репозитория: https://github.com/jac99/MinkLoc3Dv2, MIT License

source: Base ResNet class for sparse tensors with MinkowskiEngine.
ru: Базовый класс ResNet для разреженных тензоров с MinkowskiEngine.

source: Bases: :py:class:`~opr.modules.feature_extractors.mink_resnet.MinkResNetBase`
ru: Основы: :py:class:`~opr.modules.feature_extractors.mink_resnet.MinkResNetBase`

source: Feature Pyramid Network (FPN) architecture implementation using Minkowski ResNet building blocks.
ru: Реализация архитектуры Feature Pyramid Network (FPN) с использованием строительных блоков Minkowski ResNet.

source: ResNet-based image feature extractors.
ru: Модули извлечения признаков изображений на основе ResNet.

source: Bases: :py:class:`~opr.modules.feature_extractors.resnet.ResNetFPNFeatureExtractor`
ru: Основы: :py:class:`~opr.modules.feature_extractors.resnet.ResNetFPNFeatureExtractor`

source: ResNet18 image feature extractor with FPN block.
ru: Модуль извлечения признаков изображений ResNet18 с блоком FPN.

source: The code is adopted from the repository: https://github.com/jac99/MinkLocMultimodal, MIT License
ru: Код взят из репозитория: https://github.com/jac99/MinkLocMultimodal, MIT License

source: Bases: :py:class:`~opr.modules.feature_extractors.resnet.ResNetFeatureExtractor`
ru: Основы: :py:class:`~opr.modules.feature_extractors.resnet.ResNetFeatureExtractor`

source: ResNet18 image feature extractor.
ru: Модуль извлечения признаков изображений ResNet18.

source: ResNet50 image feature extractor with FPN block.
ru: Модуль извлечения признаков изображений ResNet50 с блоком FPN.

source: ResNet50 image feature extractor.
ru: Модуль извлечения признаков изображений ResNet50.

source: ResNet-based image feature extractor with FPN block.
ru: Модуль извлечения признаков изображений на основе ResNet с блоком FPN.

source: ResNet-based image feature extractor.
ru: Модуль извлечения признаков изображений на основе ResNet.

source: Implementation of feature extraction model from SVT-Net.
ru: Реализация модели извлечения признаков из SVT-Net.

source: Citation:
ru: Цитата:

source: Fan, Zhaoxin, et al. "Svt-net: Super light-weight sparse voxel transformer for large scale place recognition." Proceedings of the AAAI Conference on Artificial Intelligence. Vol. 36. No. 1. 2022.
ru: Fan, Zhaoxin, et al. "Svt-net: Super light-weight sparse voxel transformer for large scale place recognition." Материалы конференции AAAI по искусственному интеллекту. Том 36. № 1. 2022.

source: Source: https://github.com/ZhenboSong/SVTNet Paper: https://arxiv.org/abs/2105.00149
ru: Источник: https://github.com/ZhenboSong/SVTNet Статья: https://arxiv.org/abs/2105.00149

source: Feature extraction model from SVT-Net.
ru: Модель извлечения признаков из SVT-Net.

source: Source: https://github.com/ZhenboSong/SVTNet
ru: Источник: https://github.com/ZhenboSong/SVTNet

source: VGG-based image feature extractors.
ru: Модули извлечения признаков изображений на основе VGG.

source: Bases: :py:class:`~opr.modules.feature_extractors.vgg.VGGFeatureExtractor`
ru: Основы: :py:class:`~opr.modules.feature_extractors.vgg.VGGFeatureExtractor`

source: VGG-based image feature extractor.
ru: Модуль извлечения признаков изображений на основе VGG.
