Repository: OPR-Project/OpenPlaceRecognition
Catalog: docs/source/locale/*/LC_MESSAGES/api/opr.pipelines.place_recognition.po
Languages: ru

source: opr.pipelines.place\_recognition package
ru: Пакет opr.pipelines.place\_recognition

source: Place Recognition pipelines.
ru: Пайплайны распознавания мест.

source: Basic Place Recognition pipelines.
ru: Базовые пайплайны распознавания мест.

source: Bases: :py:class:`object`
ru: Основы: :py:class:`object`

source: Basic Place Recognition pipeline.
ru: Базовый пайплайн распознавания мест.

source: Single sample inference.
ru: Вывод для одного образца.

source: Parameters
ru: Параметры

source: Input data. Dictionary with keys in the following format: "image_{camera_name}" for images from cameras, "mask_{camera_name}" for semantic segmentation masks, "pointcloud_lidar_coords" for pointcloud coordinates from lidar, "pointcloud_lidar_feats" for pointcloud features from lidar.
ru: Входные данные. Словарь с ключами в следующем формате: "image_{camera_name}" для изображений с камер, "mask_{camera_name}" для масок семантической сегментации, "pointcloud_lidar_coords" для координат облака точек с лидара, "pointcloud_lidar_feats" для признаков облака точек с лидара.

source: Input data. Dictionary with keys in the following format:
ru: Входные данные. Словарь с ключами в следующем формате:

source: "image_{camera_name}" for images from cameras,
ru: "image_{camera_name}" для изображений с камер,

source: "mask_{camera_name}" for semantic segmentation masks,
ru: "mask_{camera_name}" для масок семантической сегментации,

source: "pointcloud_lidar_coords" for pointcloud coordinates from lidar,
ru: "pointcloud_lidar_coords" для координат облака точек с лидара,

source: "pointcloud_lidar_feats" for pointcloud features from lidar.
ru: "pointcloud_lidar_feats" для признаков облака точек с лидара.

source: Returns
ru: Возвращает

source: Inference results. Dictionary with keys: "idx" for predicted index in the database, "pose" for predicted pose in the format [tx, ty, tz, qx, qy, qz, qw], "descriptor" for predicted descriptor.
ru: Результаты вывода. Словарь с ключами: "idx" для предсказанного индекса в базе данных, "pose" для предсказанной позы в формате [tx, ty, tz, qx, qy, qz, qw], "descriptor" для предсказанного дескриптора.

source: Inference results. Dictionary with keys:
ru: Результаты вывода. Словарь с ключами:

source: "idx" for predicted index in the database,
ru: "idx" для предсказанного индекса в базе данных,

source: "pose" for predicted pose in the format [tx, ty, tz, qx, qy, qz, qw],
ru: "pose" для предсказанной позы в формате [tx, ty, tz, qx, qy, qz, qw],

source: "descriptor" for predicted descriptor.
ru: "descriptor" для предсказанного дескриптора.

source: Return type
ru: Тип возвращаемого значения

source: Bases: :py:class:`~opr.pipelines.place_recognition.base.PlaceRecognitionPipeline`
ru: Основы: :py:class:`~opr.pipelines.place_recognition.base.PlaceRecognitionPipeline`

source: Finds the most similar ID in the database based on the given query.
ru: Находит наиболее похожий ID в базе данных на основе заданного запроса.

source: The query to compare against the database labels.
ru: Запрос для сравнения с метками базы данных.

source: Whether to ignore stopwords during comparison. Defaults to False.
ru: Следует ли игнорировать стоп-слова во время сравнения. По умолчанию False.

source: Whether to normalize the text before comparison. Defaults to False.
ru: Следует ли нормализовать текст перед сравнением. По умолчанию False.

source: Whether to print additional information during the process. Defaults to False.
ru: Следует ли печатать дополнительную информацию во время процесса. По умолчанию False.

source: A tuple containing the best match ID, the corresponding labels, and the highest similarity score.
ru: Кортеж, содержащий лучший ID соответствия, соответствующие метки и наивысший показатель сходства.

source: Retrieve all labels associated with a given ID from the labels dictionary.
ru: Извлеките все метки, связанные с заданным ID, из словаря меток.

source: The list of labels.
ru: Список меток.

source: The ID to retrieve labels for.
ru: ID для извлечения меток.

source: The list of labels associated with the given ID.
ru: Список меток, связанных с заданным ID.

source: Input data. Dictionary with keys in the following format: "image_{camera_name}" for images from cameras, "mask_{camera_name}" for semantic segmentation masks, "pointcloud_lidar_coords" for pointcloud coordinates from lidar, "pointcloud_lidar_feats" for pointcloud features from lidar. "text_similarity_thresh" Text similarity threshold. Defaults to 50.
ru: Входные данные. Словарь с ключами в следующем формате: "image_{camera_name}" для изображений с камер, "mask_{camera_name}" для масок семантической сегментации, "pointcloud_lidar_coords" для координат облака точек с лидара, "pointcloud_lidar_feats" для признаков облака точек с лидара. "text_similarity_thresh" Порог сходства текста. По умолчанию 50.

source: "text_similarity_thresh" Text similarity threshold. Defaults to 50.
ru: "text_similarity_thresh" Порог сходства текста. По умолчанию 50.

source: Normalize a list of labels by converting them to lowercase and removing leading/trailing whitespace.
ru: Нормализуйте список меток, преобразовав их в нижний регистр и удалив начальные/конечные пробелы.

source: The list of labels to be normalized.
ru: Список меток для нормализации.

source: The normalized list of labels.
ru: Нормализованный список меток.

source: Removes stopwords from a list of labels.
ru: Удаляет стоп-слова из списка меток.

source: The list of labels to remove stopwords from.
ru: Список меток для удаления стоп-слов.

source: The list of stopwords to be removed. Defaults to ["выход", "мфти"].
ru: Список стоп-слов для удаления. По умолчанию ["выход", "мфти"].

source: The list of labels with stopwords removed.
ru: Список меток с удаленными стоп-словами.

source: Input data. Dictionary with keys in the following format: "image_{camera_name}" for images from cameras, "mask_{camera_name}" for semantic segmentation masks, "pointcloud_lidar_coords" for pointcloud coordinates from lidar, "pointcloud_lidar_feats" for pointcloud features from lidar. "query_labels" List of query labels. "text_similarity_thresh" Text similarity threshold. Defaults to 50.
ru: Входные данные. Словарь с ключами в следующем формате: "image_{camera_name}" для изображений с камер, "mask_{camera_name}" для масок семантической сегментации, "pointcloud_lidar_coords" для координат облака точек с лидара, "pointcloud_lidar_feats" для признаков облака точек с лидара. "query_labels" Список меток запроса. "text_similarity_thresh" Порог сходства текста. По умолчанию 50.

source: "query_labels" List of query labels.
ru: "query_labels" Список меток запроса.
