Repository: OPR-Project/OpenPlaceRecognition
Catalog: docs/source/locale/*/LC_MESSAGES/featured_modules/05_localization_with_dynamic_objects.po
Languages: ru

source: LocalizationPipeline with dynamic objects
ru: LocalizationPipeline с динамическими объектами

source: To increase quality of place recognition with localization in highly dynamic environments you can consider to add objects masking (both on lidar and images) to prevent feature extraction in those regions.
ru: Модуль, реализующий нейросетевой алгоритм глобальной локализации, позволяющего исключить наличие в мультимодальных данных динамических объектов (людей, животных, транспортных средств).

source: Usage example
ru: Пример использования

source: You should start with initializing neural model :class:`opr.models.place_recognition.base.LateFusionModel` with the image and cloud modules. The recommended way to do this is to use the `configs/model/place_recognition/multi-image_lidar_late-fusion.yaml <https://github.com/OPR-Project/OpenPlaceRecognition/blob/main/configs/model/place_recognition/multi-image_lidar_late-fusion.yaml>`_ config file to instantiate the model with Hydra and load the weights from the ``"weights/place_recognition/multi-image_lidar_late-fusion_nclt.pth"`` or other file.
ru: Начните с инициализации нейронной модели :class:`opr.models.place_recognition.base.LateFusionModel` с модулями изображений и облаков. Рекомендуемый способ сделать это - использовать файл конфигурации `configs/model/place_recognition/multi-image_lidar_late-fusion.yaml <https://github.com/OPR-Project/OpenPlaceRecognition/blob/main/configs/model/place_recognition/multi-image_lidar_late-fusion.yaml>`_ для создания экземпляра модели с помощью Hydra и загрузки весов из файла ``"weights/place_recognition/multi-image_lidar_late-fusion_nclt.pth"`` или другого файла.

source: In the similar manner you should initialize the registration model with the `configs/model/registration/hregnet_light_feats.yaml <https://github.com/OPR-Project/OpenPlaceRecognition/blob/main/configs/model/registration/hregnet_light_feats.yaml>`_ config:
ru: Аналогичным образом следует инициализировать модель регистрации с помощью конфигурации `configs/model/registration/hregnet_light_feats.yaml <https://github.com/OPR-Project/OpenPlaceRecognition/blob/main/configs/model/registration/hregnet_light_feats.yaml>`_:

source: Then you should initialize the :class:`opr.pipelines.localization.base.LocalizationPipeline` which consists of two sub-pipelines: :class:`opr.pipelines.place_recognition.base.PlaceRecognitionPipeline` and :class:`opr.pipelines.registration.pointcloud.PointcloudRegistrationPipeline`.
ru: Затем следует инициализировать :class:`opr.pipelines.localization.base.LocalizationPipeline`, который состоит из двух под-пайплайнов: :class:`opr.pipelines.place_recognition.base.PlaceRecognitionPipeline` и :class:`opr.pipelines.registration.pointcloud.PointcloudRegistrationPipeline`.

source: To apply masking you should extract segmentation results and place them in data folder.
ru: Чтобы применить маскирование, следует извлечь результаты сегментации и поместить их в папку с данными.

source: During getitem image and lidar data will be masked automatically by selected indices. For proper lidar masking external transformation between sensors should be set in `opr.datasets.base.BasePlaceRecognitionDataset`. You can find example in `opr.datasets.itlp.ITLPCampus`.
ru: Во время getitem данные изображения и лидара будут автоматически маскироваться по выбранным индексам. Для правильного маскирования лидара в `opr.datasets.base.BasePlaceRecognitionDataset` следует установить внешнее преобразование между датчиками. Пример можно найти в `opr.datasets.itlp.ITLPCampus`.

source: Then you can use the pipeline to infer the location of the input query data as a usual :class:`opr.pipelines.localization.base.LocalizationPipeline` :
ru: Затем вы можете использовать пайплайн для определения местоположения входных данных запроса как обычный :class:`opr.pipelines.localization.base.LocalizationPipeline`:

source: The pipeline will return the output dictionary with the following keys:
ru: Пайплайн вернет выходной словарь со следующими ключами:

source: ``"db_match_pose"``: the pose of the most similar record in the database
ru: ``"db_match_pose"``: поза наиболее похожей записи в базе данных

source: ``"estimated_pose"``: the estimated pose of the query data after registration
ru: ``"estimated_pose"``: оценочная поза данных запроса после регистрации

source: More usage examples can be found in the following notebooks:
ru: Больше примеров использования можно найти в следующих ноутбуках:
