Repository: OPR-Project/OpenPlaceRecognition
Catalog: docs/source/locale/*/LC_MESSAGES/featured_modules/10_depth_estimation_pipeline.po
Languages: ru

source: A method that implements depth map reconstruction from a monocular image by a neural network and scaling of the reconstructed depth map using a sparse lidar point cloud.
ru: Модуль, реализующий алгоритм восстановления карты глубин монокулярного изображения с учетом разреженного облака точек лидара транспортного средства.

source: Usage example
ru: Пример использования

source: This is an example of indoor depth reconstruction with state-of-the-art (2024) DepthAnything-v2 neural network model. At start, you should first initialize depth estimation neural network model, which can be imported from `the DepthAnything-v2 package which is added to OPR as a submodule <https://github.com/DepthAnything/Depth-Anything-V2/tree/28ad5a0797dfb8ac76d1e3dcddbe2160cbcc6c8d>`_:
ru: Это пример реконструкции глубины внутри помещения с использованием современной (2024 г.) нейросетевой модели DepthAnything-v2. В начале следует инициализировать нейросетевую модель оценки глубины, которую можно импортировать из `пакета DepthAnything-v2, добавленного в OPR в качестве подмодуля <https://github.com/DepthAnything/Depth-Anything-V2/tree/28ad5a0797dfb8ac76d1e3dcddbe2160cbcc6c8d>`_:

source: For the best performance, we recommend to use version "small" of the model:
ru: Для наилучшей производительности рекомендуется использовать версию "small" модели:

source: Next, you should create an instance of DepthEstimationPipeline. It requires a camera intrinsic matrix and a lidar-to-camera transformation matrix for correct operation. This is an example of the matrices for ITLP-Campus dataset:
ru: Далее следует создать экземпляр DepthEstimationPipeline. Для корректной работы требуются матрица внутренних параметров камеры и матрица преобразования лидара в камеру. Это пример матриц для набора данных ITLP-Campus:

source: Create the DepthEstimationPipeline with these matrices:
ru: Создайте DepthEstimationPipeline с этими матрицами:

source: Now you can run the pipeline on a pair of an RGB image and a lidar point cloud:
ru: Теперь вы можете запустить конвейер на паре RGB-изображения и облака точек лидара:

source: ``"test_img"`` is an RGB image stored as numpy.ndarray of shape (h, w, 3) and uint8 data type
ru: ``"test_img"`` - это RGB-изображение, хранящееся в виде numpy.ndarray с формой (h, w, 3) и типом данных uint8

source: ``"test_cloud"`` is a lidar point cloud stored as numpy.ndarray of shape (N, 3) and float data type (the values are (x, y, z) coordinates in meters)
ru: ``"test_cloud"`` - это облако точек лидара, хранящееся в виде numpy.ndarray с формой (N, 3) и типом данных float (значениями являются координаты (x, y, z) в метрах)

source: ``"predicted_depth"`` is the reconstructed depth stored as numpy.ndarray of shape (h, w) and float data type. The values of the array are depths in meters.
ru: ``"predicted_depth"`` - это реконструированная глубина, хранящаяся в виде numpy.ndarray с формой (h, w) и типом данных float. Значениями массива являются глубины в метрах.

source: An illustrated demo of the work of DepthEstimationPipeline can be found in `the demo notebook <https://github.com/OPR-Project/OpenPlaceRecognition/blob/depth_reconstruction_nclt/notebooks/test_depth_reconstruction.ipynb>`_
ru: Иллюстрированную демонстрацию работы DepthEstimationPipeline можно найти в `демонстрационном блокноте <https://github.com/OPR-Project/OpenPlaceRecognition/blob/depth_reconstruction_nclt/notebooks/test_depth_reconstruction.ipynb>`_
