Repository: OPR-Project/OpenPlaceRecognition
Catalog: docs/source/locale/*/LC_MESSAGES/featured_modules/11_latefusion_with_semantics.po
Languages: ru

source: LateFusionModel with semantics
ru: LateFusionModel с семантикой

source: A module that implements a neural network algorithm for encoding records using sequences of data from lidars and cameras.
ru: Модуль, реализующий алгоритм формирования единого векторного представления изображений и трехмерных облаков точек с учетом их семантической сегментации.

source: Usage example
ru: Пример использования

source: You should start with initializing neural model :class:`opr.models.place_recognition.base.LateFusionModel` with the image, semantic and cloud modules. The recommended way to do this is to use the `configs/model/place_recognition/multi-image_multi-semantic_lidar_late-fusion.yaml <https://github.com/OPR-Project/OpenPlaceRecognition/blob/main/configs/model/place_recognition/multi-image_multi-semantic_lidar_late-fusion.yaml>`_ config file to instantiate the model with Hydra and load the weights from the ``"weights/place_recognition/multi-image_multi-semantic_lidar_late-fusion_nclt.pth"`` or other file.
ru: Начните с инициализации нейронной модели :class:`opr.models.place_recognition.base.LateFusionModel` с модулями изображений, семантики и облаков. Рекомендуемый способ сделать это - использовать файл конфигурации `configs/model/place_recognition/multi-image_multi-semantic_lidar_late-fusion.yaml <https://github.com/OPR-Project/OpenPlaceRecognition/blob/main/configs/model/place_recognition/multi-image_multi-semantic_lidar_late-fusion.yaml>`_ для создания экземпляра модели с помощью Hydra и загрузки весов из файла ``"weights/place_recognition/multi-image_multi-semantic_lidar_late-fusion_nclt.pth"`` или другого файла.

source: Then you can use the ``pr_model`` to infer the sensor's data:
ru: Затем вы можете использовать ``pr_model`` для получения данных датчика:

source: The ``pr_model`` will return the ``output`` dictionary with the following keys:
ru: ``pr_model`` вернет словарь ``output`` со следующими ключами:

source: ``"final_descriptor"``: fused descriptor (torch.tensor) of all sensor's data
ru: ``"final_descriptor"``: объединенный дескриптор (torch.tensor) всех данных датчика

source: ``"image"`` (optional): descriptor (torch.tensor) of image in sequence
ru: ``"image"`` (опционально): дескриптор (torch.tensor) изображения в последовательности

source: ``"semantic"`` (optional): descriptor (torch.tensor) of image semantic mask in sequence
ru: ``"semantic"`` (опционально): дескриптор (torch.tensor) семантической маски изображения в последовательности

source: ``"cloud"`` (optional): descriptor (torch.tensor) of lidar point cloud in sequence
ru: ``"cloud"`` (опционально): дескриптор (torch.tensor) облака точек лидара в последовательности

source: More usage examples of ``LateFusionModel`` can be found in the following notebooks as a part of ``pr_model``:
ru: Больше примеров использования ``LateFusionModel`` можно найти в следующих ноутбуках как часть ``pr_model``:
