Repository: OPR-Project/OpenPlaceRecognition
Catalog: docs/source/locale/*/LC_MESSAGES/featured_modules/12_itlp_dataset_reader.po
Languages: ru

source: ITLPCampus Dataset Reader
ru: Модуль датасета ITLPCampus

source: A module that implements a PyTorch dataset reader for the ITLPCampus dataset.
ru: Модуль, реализующий взаимодействие PyTorch с разработанными мультимодальными наборами данных ITLPCampus.

source: More details about the dataset can be found on the :doc:`../itlp_dataset` page.
ru: Более подробную информацию о датасете можно найти на странице :doc:`../itlp_dataset`.

source: Below is a usage example of the dataset reader that is implemented as part of the OpenPlaceRecognition library.
ru: Ниже приведен пример использования reader датасета, реализованного как часть библиотеки OpenPlaceRecognition.

source: Usage example
ru: Пример использования

source: You should start with initializing the dataset reader by creating an instance of the :class:`opr.datasets.itlp.ITLPCampus` class with appropriate parameters.
ru: Начните с инициализации reader датасета, создав экземпляр класса :class:`opr.datasets.itlp.ITLPCampus` с соответствующими параметрами.

source: The ``sample`` will contain a dictionary with the following keys:
ru: ``sample`` будет содержать словарь со следующими ключами:

source: ``"idx"``: index of the sample in the dataset
ru: ``"idx"``: индекс образца в датасете

source: ``"pose"``: 7-element pose vector [tx, ty, tz, qx, qy, qz, qw]
ru: ``"pose"``: 7-элементный вектор позы [tx, ty, tz, qx, qy, qz, qw]

source: ``"image_front_cam"``: tensor of front camera image (if "front_cam" in sensors)
ru: ``"image_front_cam"``: тензор изображения с передней камеры (если "front_cam" в sensors)

source: ``"image_back_cam"``: tensor of back camera image (if "back_cam" in sensors)
ru: ``"image_back_cam"``: тензор изображения с задней камеры (если "back_cam" в sensors)

source: ``"mask_front_cam"``: tensor of front camera semantic mask (if load_semantics=True)
ru: ``"mask_front_cam"``: тензор семантической маски передней камеры (если load_semantics=True)

source: ``"mask_back_cam"``: tensor of back camera semantic mask (if load_semantics=True)
ru: ``"mask_back_cam"``: тензор семантической маски задней камеры (если load_semantics=True)

source: ``"pointcloud_lidar_coords"``: tensor of LiDAR point coordinates (if "lidar" in sensors)
ru: ``"pointcloud_lidar_coords"``: тензор координат точек LiDAR (если "lidar" в sensors)

source: ``"pointcloud_lidar_feats"``: tensor of LiDAR point features (if "lidar" in sensors)
ru: ``"pointcloud_lidar_feats"``: тензор признаков точек LiDAR (если "lidar" в sensors)

source: To create a DataLoader for batch training or inference:
ru: Чтобы создать DataLoader для пакетного обучения или инференса:

source: For indoor datasets, you can specify train/test splits:
ru: Для внутренних датасетов вы можете указать разделение на train/test:

source: More examples of using the ``ITLPCampus`` dataset reader can be found in the notebooks:
ru: Больше примеров использования reader датасета ``ITLPCampus`` можно найти в ноутбуках:
