Repository: OPR-Project/OpenPlaceRecognition
Catalog: docs/source/locale/*/LC_MESSAGES/featured_modules/13_topological_localization_pipeline.po
Languages: ru

source: A module which performs twofold localization (place recognition and pose registration) leveraging the topological properties of the environment. The module builds a topological graph from the input database and outputs pose and corresponding node in the graph for each query.
ru: Модуль, выполняющий двухэтапную локализацию (распознавание места и регистрацию позы), используя топологические свойства окружающей среды. Модуль строит топологический граф из входной базы данных и выводит позу и соответствующий узел в графе для каждого запроса.

source: Usage example
ru: Пример использования

source: First, you should create the database for localization from a pre-processed dataset. The recommended way to do it is the usage of `opr.datasets` API. An example of building a database is shown in the notebook `notebooks/build_database.ipynb <https://github.com/OPR-Project/OpenPlaceRecognition/blob/main/notebooks/build_database.ipynb>`_.
ru: Сначала вам следует создать базу данных для локализации из предварительно обработанного набора данных. Рекомендуемый способ - использование API `opr.datasets`. Пример построения базы данных показан в блокноте `notebooks/build_database.ipynb <https://github.com/OPR-Project/OpenPlaceRecognition/blob/main/notebooks/build_database.ipynb>`_.

source: After that, you should initialize the :class:`opr.pipelines.localization.base.TopologicalLocalizationPipeline` which consists of two sub-pipelines: :class:`opr.pipelines.place_recognition.base.PlaceRecognitionPipeline` and :class:`opr.pipelines.registration.pointcloud.PointcloudRegistrationPipeline`.
ru: После этого вам следует инициализировать :class:`opr.pipelines.localization.base.TopologicalLocalizationPipeline`, который состоит из двух под-конвейеров: :class:`opr.pipelines.place_recognition.base.PlaceRecognitionPipeline` и :class:`opr.pipelines.registration.pointcloud.PointcloudRegistrationPipeline`.

source: As a place recognition model, you can use :class:`opr.models.place_recognition.base.LateFusionModel`.
ru: В качестве модели распознавания мест вы можете использовать :class:`opr.models.place_recognition.base.LateFusionModel`.

source: As a registration model, you can use the `GeoTransformer <https://github.com/alexmelekhin/GeoTransformer/tree/1e56f104ee88cb60734ad9344e28b6d64536c2e8>`_ neural network model:
ru: В качестве модели регистрации вы можете использовать нейронную сеть `GeoTransformer <https://github.com/alexmelekhin/GeoTransformer/tree/1e56f104ee88cb60734ad9344e28b6d64536c2e8>`_:

source: Then you can use the pipeline to infer the location of the input query data:
ru: Затем вы можете использовать конвейер для определения местоположения входных данных запроса:

source: The pipeline will return the output dictionary with the following keys:
ru: Конвейер вернет выходной словарь со следующими ключами:

source: ``"db_match_pose"``: the pose of the location in the database found by place recognition model with topological restrictions.
ru: ``"db_match_pose"``: поза местоположения в базе данных, найденная моделью распознавания мест с топологическими ограничениями.

source: ``"current_node"``: the index of the found location in the topological graph.
ru: ``"current_node"``: индекс найденного местоположения в топологическом графе.

source: ``"estimated_pose"``: the estimated pose refined by point cloud registration.
ru: ``"estimated_pose"``: оценочная поза, уточненная регистрацией облака точек.

source: More usage examples can be found in the notebook `notebooks/topological_pipeline.ipynb <https://github.com/OPR-Project/OpenPlaceRecognition/blob/main/notebooks/topological_pipeline.ipynb>`_
ru: Больше примеров использования можно найти в блокноте `notebooks/topological_pipeline.ipynb <https://github.com/OPR-Project/OpenPlaceRecognition/blob/main/notebooks/topological_pipeline.ipynb>`_.
