Repository: OPR-Project/OpenPlaceRecognition
Catalog: docs/source/locale/*/LC_MESSAGES/index.po
Languages: ru

source: ``"pointcloud_lidar_coords"``: point cloud coordinates Tensor of shape ``(N_points, 4)``
ru: ``"pointcloud_lidar_coords"``: координаты облака точек, тензор размерности ``(N_points, 4)``

source: ``"pointcloud_lidar_feats"``: point cloud features Tensor of shape ``(N_points, C)``
ru: ``"pointcloud_lidar_feats"``: признаки облака точек, тензор размерности ``(N_points, C)``

source: **Output:** a dictionary with keys:
ru: **Выход:** словарь с ключами:

source: ``"idx"`` for predicted index in the database,
ru: ``"idx"`` — предсказанный индекс в базе данных,

source: ``"pose"`` for predicted pose in the format ``[tx, ty, tz, qx, qy, qz, qw]``,
ru: ``"pose"`` — предсказанная поза в формате ``[tx, ty, tz, qx, qy, qz, qw]``,

source: ``"descriptor"`` for predicted descriptor.
ru: ``"descriptor"`` — предсказанный дескриптор.

source: More details can be found in the `demo_pipelines.ipynb <https://github.com/OPR-Project/OpenPlaceRecognition/blob/main/notebooks/demo_pipelines.ipynb>`_ notebook.
ru: Дополнительные подробности можно найти в ноутбуке `demo_pipelines.ipynb <https://github.com/OPR-Project/OpenPlaceRecognition/blob/main/notebooks/demo_pipelines.ipynb>`_.

source: *WIP*
ru: *В разработке*

source: Connected Projects
ru: Связанные проекты

source: `OPR-Project/OpenPlaceRecognition-ROS2 <https://github.com/OPR-Project/OpenPlaceRecognition-ROS2>`_ - ROS-2 implementation of OpenPlaceRecognition modules
ru: `OPR-Project/OpenPlaceRecognition-ROS2 <https://github.com/OPR-Project/OpenPlaceRecognition-ROS2>`_ — реализация модулей OpenPlaceRecognition для ROS-2.

source: `OPR-Project/ITLP-Campus <https://github.com/OPR-Project/ITLP-Campus>`_ - ITLP-Campus dataset tools.
ru: `OPR-Project/ITLP-Campus <https://github.com/OPR-Project/ITLP-Campus>`_ — инструменты для работы с датасетом ITLP-Campus.

source: `KirillMouraviev/simple_toposlam_model <https://github.com/KirillMouraviev/simple_toposlam_model>`_ - An implementation of the Topological SLAM method that uses the OPR library.
ru: `KirillMouraviev/simple_toposlam_model <https://github.com/KirillMouraviev/simple_toposlam_model>`_ — реализация метода Topological SLAM, использующая библиотеку OPR.
