Repository: OPR-Project/OpenPlaceRecognition
Catalog: docs/source/locale/*/LC_MESSAGES/index.po
Languages: ru

source: Introduction
ru: Введение

source: Contents:
ru: Содержание:

source: Open Place Recognition library
ru: Библиотека Open Place Recognition

source: *An overview of a typical place recognition pipeline. At first, the input data is encoded into a query descriptor. Then, a K-nearest neighbors search is performed between the query and the database. Finally, the position of the closest database descriptor found is considered as the answer.*
ru: *Обзор типичного пайплайна распознавания мест. Сначала входные данные кодируются в дескриптор запроса. Затем выполняется поиск K ближайших соседей между запросом и базой данных. В конце позиция ближайшего найденного дескриптора в базе данных считается ответом.*

source: This library is suitable for:
ru: Эта библиотека подходит для:

source: 🚗 **Navigation of autonomous cars, robots, and drones** using cameras and lidars, especially in areas with limited or unavailable GPS signals.
ru: 🚗 **Навигации автономных автомобилей, роботов и дронов**, использующих камеры и лидары, особенно в зонах с ограниченным или недоступным сигналом GPS.

source: 📦 **Localization of delivery robots** needing reliable positioning both indoors and outdoors.
ru: 📦 **Локализации роботов-доставщиков**, требующих надежного позиционирования как внутри помещений, так и на открытых пространствах.

source: 🔬 **Research and development of computer vision algorithms**, related to multimodal place recognition and localization.
ru: 🔬 **Исследований и разработки алгоритмов компьютерного зрения**, связанных с мультимодальным распознаванием и локализацией мест.

source: 🎓 **Educational purposes and research projects**, involving robotics, autonomous systems, and computer vision.
ru: 🎓 **Учебных и исследовательских проектов**, включающих робототехнику, автономные системы и компьютерное зрение.

source: Installation
ru: Установка

source: Requirements
ru: Требования

source: Hardware
ru: Аппаратное обеспечение

source: **CPU**: 6 or more physical cores
ru: **CPU**: 6 или более физических ядер

source: **RAM**: at least 8 GB
ru: **RAM**: не менее 8 ГБ

source: **GPU**: NVIDIA RTX 2060 or higher (to ensure adequate performance)
ru: **GPU**: NVIDIA RTX 2060 или выше (для обеспечения достаточной производительности)

source: **Video memory**: at least 4 GB
ru: **Видеопамять**: не менее 4 ГБ

source: **Storage**: SSD recommended for faster loading of data and models
ru: **Хранилище**: рекомендуется SSD для более быстрой загрузки данных и моделей

source: We recommend using NVIDIA Jetson Xavier AGX. *The library should be compatible with all newer versions of devices, but we haven't tested them yet.*
ru: Мы рекомендуем использовать NVIDIA Jetson Xavier AGX. *Библиотека должна быть совместима с новыми версиями устройств, но мы пока их не тестировали.*

source: Software
ru: Программное обеспечение

source: **Operating System**:
ru: **Операционная система**:

source: **x86_64**: Any OS with support for Docker and CUDA >= 11.1. *Ubuntu 20.04 or later is recommended.*
ru: **x86_64**: Любая ОС с поддержкой Docker и CUDA >= 11.1. *Рекомендуется Ubuntu 20.04 и новее.*

source: **NVIDIA Jetson**: Ubuntu 20.04 or later with Jetpack >= 5.0.
ru: **NVIDIA Jetson**: Ubuntu 20.04 и новее с Jetpack >= 5.0.

source: **Dependencies** (if not using Docker): see the `Advanced` section below.
ru: **Зависимости** (если не используется Docker): см. раздел `Advanced` ниже.

source: Quick-start
ru: Быстрый старт

source: At first, ensure that you cloned the repository https://github.com/OPR-Project/OpenPlaceRecognition and changed the directory to the root of the repository:
ru: Сначала убедитесь, что вы клонировали репозиторий https://github.com/OPR-Project/OpenPlaceRecognition и перешли в корневую директорию репозитория:

source: The recommended and easiest way to use the library is through the provided Docker environment. The ``Dockerfile.base`` contains all prerequisites needed to run the library, including optional `MinkowskiEngine <https://github.com/NVIDIA/MinkowskiEngine>`_ and `faiss <https://github.com/facebookresearch/faiss>`_ libraries. You can either pull this image from Docker Hub (``docker pull alexmelekhin/open-place-recognition:base``), or build it manually (``bash docker/build_base.sh``).
ru: Рекомендуемый и самый простой способ использовать библиотеку — это предоставляемое Docker-окружение. Файл ``Dockerfile.base`` содержит все необходимые компоненты для запуска библиотеки, включая опциональные библиотеки `MinkowskiEngine <https://github.com/NVIDIA/MinkowskiEngine>`_ и `faiss <https://github.com/facebookresearch/faiss>`_. Вы можете либо загрузить этот образ из Docker Hub (``docker pull alexmelekhin/open-place-recognition:base``), либо собрать его вручную (``bash docker/build_base.sh``).

source: The ``Dockerfile.devel`` installs additional requirements from ``requirements.txt``, ``requirements-dev.txt``, and ``requirements-notebook.txt`` files, and creates a non-root user inside the image to avoid permission issues when using the container with mounted volumes.
ru: Файл ``Dockerfile.devel`` устанавливает дополнительные требования из файлов ``requirements.txt``, ``requirements-dev.txt`` и ``requirements-notebook.txt``, а также создаёт пользователя без root-прав для предотвращения проблем с правами при использовании контейнера с подключёнными томами.

source: The ``devel`` version of the image should be built manually by the user:
ru: Версия образа ``devel`` должна быть собрана вручную пользователем:

source: When starting the container, you must provide a data directory that will be mounted to ``~/Datasets`` inside the container:
ru: При запуске контейнера необходимо указать директорию с данными, которая будет подключена в ``~/Datasets`` внутри контейнера:

source: To enter the container's ``/bin/bash`` terminal, use the ``docker/into.sh`` script:
ru: Чтобы войти в терминал контейнера ``/bin/bash``, используйте скрипт ``docker/into.sh``:

source: After you enter the container, install the library (we recommend installing in editable mode with the ``-e`` flag to be able to make modifications to the code):
ru: После входа в контейнер установите библиотеку (рекомендуется устанавливать в редактируемом режиме с флагом ``-e``, чтобы иметь возможность вносить изменения в код):

source: Third-party packages
ru: Сторонние пакеты

source: Some modules and pipelines require third-party packages to be installed manually. You can install these dependencies with the following commands:
ru: Некоторые модули и пайплайны требуют ручной установки сторонних пакетов. Вы можете установить эти зависимости с помощью следующих команд:

source: If you want to use the `GeoTransformer` model for pointcloud registration, you should install the package located in the `third_party` directory:
ru: Если вы хотите использовать модель `GeoTransformer` для регистрации облаков точек, вам следует установить пакет из директории `third_party`:

source: If you are seeing `Permission denied` error, you should run the command with `sudo`:
ru: Если вы столкнулись с ошибкой `Permission denied`, выполните команду через `sudo`:

source: If you want to use the `HRegNet` model for pointcloud registration, you should install the package located in the `third_party` directory:
ru: Если вы хотите использовать модель `HRegNet` для регистрации облаков точек, вам следует установить пакет из директории `third_party`:

source: If you are seeing `Permission denied` error while trying to install PointUtils, you should run the command with `sudo`:
ru: Если вы столкнулись с ошибкой `Permission denied` при попытке установки PointUtils, выполните команду через `sudo`:

source: **Note:** If you are using the provided Docker environment, the default password for the user `docker_opr` can be found in the ``Dockerfile.devel`` file:
ru: **Примечание:** Если вы используете предоставленное Docker-окружение, пароль по умолчанию для пользователя `docker_opr` можно найти в файле ``Dockerfile.devel``:

source: You can change the password by providing the `PW` build-time argument in the `docker/build_devel.sh` script:
ru: Вы можете изменить пароль, указав аргумент `PW` при сборке образа с помощью скрипта `docker/build_devel.sh`:

source: Advanced
ru: Расширенная установка

source: For a manual installation, you'll need to install several prerequisite libraries:
ru: Для ручной установки необходимо установить несколько библиотек-зависимостей:

source: **PyTorch** is the main dependency for our library. We recommend using version ``>=2.1.2``. Please refer to the `PyTorch Get Started <https://pytorch.org/get-started/locally/>`_ documentation for installation instructions.
ru: **PyTorch** — главная зависимость нашей библиотеки. Мы рекомендуем использовать версию ``>=2.1.2``. Подробности установки см. в документации `PyTorch Get Started <https://pytorch.org/get-started/locally/>`_.

source: **torchvision** is a PyTorch library that provides datasets, transforms, and models for computer vision. It should be installed with PyTorch. Please refer to the `PyTorch Get Started <https://pytorch.org/get-started/locally/>`_ documentation. If you want to install it separately, please refer to the `torchvision GitHub repository <https://github.com/pytorch/vision>`_.
ru: **torchvision** — библиотека PyTorch, предоставляющая наборы данных, трансформации и модели для компьютерного зрения. Обычно она устанавливается вместе с PyTorch. Подробнее см. документацию `PyTorch Get Started <https://pytorch.org/get-started/locally/>`_. Если хотите установить её отдельно, обратитесь к репозиторию `torchvision GitHub <https://github.com/pytorch/vision>`_.

source: **MinkowskiEngine** is a library for sparse tensor operations. We recommend using the fork of the library, which is compatible with CUDA 12. Please refer to the `Official Installation Guide <https://github.com/NVIDIA/MinkowskiEngine/wiki/Installation>`_, but instead of the official repository, use the fork: `<https://github.com/alexmelekhin/MinkowskiEngine.git>`_.
ru: **MinkowskiEngine** — библиотека для операций с разреженными тензорами. Мы рекомендуем использовать форк библиотеки, совместимый с CUDA 12. Инструкцию по установке можно найти в `Official Installation Guide <https://github.com/NVIDIA/MinkowskiEngine/wiki/Installation>`_, но вместо официального репозитория используйте форк: `<https://github.com/alexmelekhin/MinkowskiEngine.git>`_.

source: **faiss** is a library for efficient similarity search and clustering of dense vectors. Please refer to the `faiss GitHub repository <https://github.com/facebookresearch/faiss>`_ for installation instructions. The recommended version is ``>=1.7.4``. We recommend using the GPU version of the library because our pipelines use it for better performance.
ru: **faiss** — библиотека для эффективного поиска похожих элементов и кластеризации плотных векторов. Подробнее см. репозиторий `faiss GitHub <https://github.com/facebookresearch/faiss>`_. Рекомендуемая версия — ``>=1.7.4``. Рекомендуется использовать GPU-версию библиотеки для лучшей производительности наших пайплайнов.

source: **Open3D** is a library for 3D data processing. Please refer to the `Open3D documentation <https://www.open3d.org/docs/release/getting_started.html>`_ for installation instructions. We recommend using the GPU version of the library because our pipelines use it for better performance.
ru: **Open3D** — библиотека для обработки 3D-данных. Подробнее см. документацию `Open3D documentation <https://www.open3d.org/docs/release/getting_started.html>`_. Рекомендуется использовать GPU-версию библиотеки для улучшения производительности наших пайплайнов.

source: **PaddlePaddle** and **PaddleOCR** are used for text-based place recognition pipelines. Please refer to the `PaddlePaddle Quick Start Guide <https://www.paddlepaddle.org.cn/en/install/quick>`_ for installation instructions. We recommend using the GPU version of the library because our pipelines use it for better performance. After installing PaddlePaddle, you can install PaddleOCR via pip: ``pip install paddleocr``.
ru: **PaddlePaddle** и **PaddleOCR** используются для пайплайнов распознавания мест на основе текста. Подробнее см. инструкцию `PaddlePaddle Quick Start Guide <https://www.paddlepaddle.org.cn/en/install/quick>`_. Рекомендуется GPU-версия библиотеки. После установки PaddlePaddle вы можете установить PaddleOCR через pip: ``pip install paddleocr``.

source: The library also depends on several performance optimization libraries that should be installed:
ru: Библиотека также зависит от нескольких библиотек для оптимизации производительности, которые необходимо установить:

source: ONNX: refer to the `ONNX GitHub repository <https://github.com/onnx/onnx?tab=readme-ov-file#installation>`_.
ru: ONNX: подробнее см. репозиторий `ONNX GitHub <https://github.com/onnx/onnx?tab=readme-ov-file#installation>`_.

source: ONNX Runtime: refer to the `Installation Guide <https://onnxruntime.ai/docs/install/#install-onnx-runtime-gpu-cuda-12x>`_.
ru: ONNX Runtime: подробнее см. `Installation Guide <https://onnxruntime.ai/docs/install/#install-onnx-runtime-gpu-cuda-12x>`_.

source: TensorRT: refer to the `Installation Guide <https://docs.nvidia.com/deeplearning/tensorrt/latest/installing-tensorrt/installing.html#python-package-index-installation>`_.
ru: TensorRT: подробнее см. `Installation Guide <https://docs.nvidia.com/deeplearning/tensorrt/latest/installing-tensorrt/installing.html#python-package-index-installation>`_.

source: Torch-TensorRT: refer to the `Installation Guide <https://pytorch.org/TensorRT/getting_started/installation.html>`_.
ru: Torch-TensorRT: подробнее см. `Installation Guide <https://pytorch.org/TensorRT/getting_started/installation.html>`_.

source: Polygraphy: refer to the `Polygraphy GitHub repository <https://github.com/NVIDIA/TensorRT/tree/main/tools/Polygraphy#installation>`_.
ru: Polygraphy: подробнее см. репозиторий `Polygraphy GitHub <https://github.com/NVIDIA/TensorRT/tree/main/tools/Polygraphy#installation>`_.

source: Please note that the manual installation of the library and its dependencies can be challenging and time-consuming. We recommend using the provided Docker environment for a quick start.
ru: Обратите внимание, что ручная установка библиотеки и её зависимостей может быть сложной и трудоёмкой. Мы рекомендуем использовать предоставленное Docker-окружение для быстрого старта.

source: If you encounter any issues during the installation process, please refer to the `OpenPlaceRecognition Issues <https://github.com/OPR-Project/OpenPlaceRecognition/issues>`_ page.
ru: Если у вас возникнут какие-либо проблемы в процессе установки, обратитесь на страницу `OpenPlaceRecognition Issues <https://github.com/OPR-Project/OpenPlaceRecognition/issues>`_.

source: How to load the weights
ru: Как загрузить веса моделей

source: You can load the weights from the Hugging Face organization `OPR-Project <https://huggingface.co/OPR-Project>`_. This is the recommended way to load the weights, as you can see the license and the README file for each model group. Note that models may have different licenses, depending on the dataset they were trained on.
ru: Вы можете загрузить веса моделей из организации Hugging Face `OPR-Project <https://huggingface.co/OPR-Project>`_. Это рекомендуемый способ загрузки весов, так как там указаны лицензии и файлы README для каждой группы моделей. Обратите внимание, что лицензии моделей могут различаться в зависимости от датасетов, на которых они обучались.

source: Alternatively, you can download the weights from the public `Google Drive folder <https://drive.google.com/drive/folders/1uRiMe2-I9b5Tgv8mIJLkdGaHXccp_UFJ?usp=sharing>`_. But please check the license for each model group on the `OPR-Project <https://huggingface.co/OPR-Project>`_ page before using them.
ru: Альтернативно вы можете скачать веса из общедоступной папки на `Google Drive <https://drive.google.com/drive/folders/1uRiMe2-I9b5Tgv8mIJLkdGaHXccp_UFJ?usp=sharing>`_. Однако перед использованием обязательно проверьте лицензию каждой группы моделей на странице `OPR-Project <https://huggingface.co/OPR-Project>`_.

source: ITLP-Campus dataset
ru: Датасет ITLP-Campus

source: We introduce the ITLP-Campus dataset. The dataset was recorded on the Husky wheeled robotic platform on the university campus and consists of tracks recorded at different times of day (day/dusk/night) and different seasons (winter/spring). You can find more details in the `OPR-Project/ITLP-Campus <https://github.com/OPR-Project/ITLP-Campus>`_ repository.
ru: Мы представляем датасет ITLP-Campus. Данные были записаны с использованием роботизированной платформы Husky на территории университетского кампуса и включают маршруты, записанные в разное время суток (день/сумерки/ночь) и в разное время года (зима/весна). Подробности доступны в репозитории `OPR-Project/ITLP-Campus <https://github.com/OPR-Project/ITLP-Campus>`_.

source: Package Structure
ru: Структура пакета

source: Subpackage containing dataset classes and functions.
ru: Подпакет, содержащий классы и функции для работы с датасетами.

source: Usage example:
ru: Пример использования:

source: The iterator will return a dictionary with the following keys:
ru: Итератор вернёт словарь со следующими ключами:

source: ``"idx"``: index of the sample in the dataset, single number Tensor
ru: ``"idx"``: индекс образца в датасете, тензор из одного числа

source: ``"utm"``: UTM coordinates of the sample, Tensor of shape ``(2)``
ru: ``"utm"``: UTM-координаты образца, тензор размерности ``(2)``

source: (optional) ``"image_stereo_centre"``: image Tensor of shape ``(C, H, W)``
ru: (опционально) ``"image_stereo_centre"``: изображение, тензор размерности ``(C, H, W)``

source: (optional) ``"pointcloud_lidar_feats"``: point cloud features Tensor of shape ``(N, 1)``
ru: (опционально) ``"pointcloud_lidar_feats"``: признаки облака точек, тензор размерности ``(N, 1)``

source: (optional) ``"pointcloud_lidar_coords"``: point cloud coordinates Tensor of shape ``(N, 3)``
ru: (опционально) ``"pointcloud_lidar_coords"``: координаты облака точек, тензор размерности ``(N, 3)``

source: In this example, we use a pre-processed version of the Oxford RobotCar dataset. We use the same subsample of tracks and preprocessed point clouds as described in the `PointNetVLAD paper <https://openaccess.thecvf.com/content_cvpr_2018/html/Uy_PointNetVLAD_Deep_Point_CVPR_2018_paper.html>`_. Additionally, we created the files "train.csv", "val.csv", and "test.csv."
ru: В этом примере используется предварительно обработанная версия датасета Oxford RobotCar. Используется та же выборка маршрутов и предобработанные облака точек, что и в статье `PointNetVLAD <https://openaccess.thecvf.com/content_cvpr_2018/html/Uy_PointNetVLAD_Deep_Point_CVPR_2018_paper.html>`_. Дополнительно созданы файлы "train.csv", "val.csv" и "test.csv".

source: You can download our version of the dataset via the following link:
ru: Вы можете скачать нашу версию датасета по следующей ссылке:

source: More details can be found in the `demo_datasets.ipynb <https://github.com/OPR-Project/OpenPlaceRecognition/blob/main/notebooks/demo_datasets.ipynb>`_ notebook.
ru: Дополнительные подробности можно найти в ноутбуке `demo_datasets.ipynb <https://github.com/OPR-Project/OpenPlaceRecognition/blob/main/notebooks/demo_datasets.ipynb>`_.

source: The ``opr.losses`` subpackage contains ready-to-use loss functions implemented in PyTorch, featuring a common interface.
ru: Подпакет ``opr.losses`` содержит готовые функции потерь, реализованные в PyTorch, с единым интерфейсом.

source: The loss functions introduce a unified interface:
ru: Функции потерь реализуют унифицированный интерфейс:

source: **Input:**
ru: **Вход:**

source: ``embeddings``: descriptor Tensor of shape ``(B, D)``
ru: ``embeddings``: дескриптор, тензор размерности ``(B, D)``

source: ``positives_mask``: boolean mask Tensor of shape ``(B, B)``
ru: ``positives_mask``: булева маска, тензор размерности ``(B, B)``

source: ``negatives_mask``: boolean mask Tensor of shape ``(B, B)``
ru: ``negatives_mask``: булева маска, тензор размерности ``(B, B)``

source: **Output:**
ru: **Выход:**

source: ``loss``: loss value Tensor
ru: ``loss``: значение функции потерь, тензор

source: ``stats``: dictionary with additional statistics
ru: ``stats``: словарь с дополнительной статистикой

source: More details can be found in the `demo_losses.ipynb <https://github.com/OPR-Project/OpenPlaceRecognition/blob/main/notebooks/demo_losses.ipynb>`_ notebook.
ru: Дополнительные подробности можно найти в ноутбуке `demo_losses.ipynb <https://github.com/OPR-Project/OpenPlaceRecognition/blob/main/notebooks/demo_losses.ipynb>`_.

source: The ``opr.models`` subpackage contains ready-to-use neural networks implemented in PyTorch, featuring a common interface.
ru: Подпакет ``opr.models`` содержит готовые нейронные сети, реализованные в PyTorch, с единым интерфейсом.

source: The models introduce unified input and output formats:
ru: Модели имеют унифицированные форматы входных и выходных данных:

source: **Input:** a ``batch`` dictionary with the following keys (all keys are optional, depending on the model and dataset):
ru: **Вход:** словарь ``batch`` со следующими ключами (все ключи опциональны, зависят от модели и датасета):

source: ``"images_<camera_name>"``: images Tensor of shape ``(B, 3, H, W)``
ru: ``"images_<camera_name>"``: изображения, тензор размерности ``(B, 3, H, W)``

source: ``"masks_<camera_name>"``: semantic segmentation masks Tensor of shape ``(B, 1, H, W)``
ru: ``"masks_<camera_name>"``: маски семантической сегментации, тензор размерности ``(B, 1, H, W)``

source: ``"pointclouds_lidar_coords"``: point cloud coordinates Tensor of shape ``(B * N_points, 4)``
ru: ``"pointclouds_lidar_coords"``: координаты облаков точек, тензор размерности ``(B * N_points, 4)``

source: ``"pointclouds_lidar_feats"``: point cloud features Tensor of shape ``(B * N_points, C)``
ru: ``"pointclouds_lidar_feats"``: признаки облаков точек, тензор размерности ``(B * N_points, C)``

source: **Output:** a dictionary with the requiered key ``"final_descriptor"`` and optional keys for intermediate descriptors:
ru: **Выход:** словарь с обязательным ключом ``"final_descriptor"`` и опциональными ключами для промежуточных дескрипторов:

source: ``"final_descriptor"``: final descriptor Tensor of shape ``(B, D)``
ru: ``"final_descriptor"``: итоговый дескриптор, тензор размерности ``(B, D)``

source: More details can be found in the `demo_models.ipynb <https://github.com/OPR-Project/OpenPlaceRecognition/blob/main/notebooks/demo_models.ipynb>`_ notebook.
ru: Дополнительные подробности можно найти в ноутбуке `demo_models.ipynb <https://github.com/OPR-Project/OpenPlaceRecognition/blob/main/notebooks/demo_models.ipynb>`_.

source: The ``opr.trainers`` subpackage contains ready-to-use training algorithms.
ru: Подпакет ``opr.trainers`` содержит готовые алгоритмы обучения.

source: The ``opr.pipelines`` subpackage contains ready-to-use pipelines for model inference.
ru: Подпакет ``opr.pipelines`` содержит готовые пайплайны для инференса моделей.

source: The pipeline introduces a unified interface for model inference:
ru: Пайплайн реализует унифицированный интерфейс для инференса моделей:

source: **Input:** a dictionary with the following keys (all keys are optional, depending on the model and dataset):
ru: **Вход:** словарь со следующими ключами (все ключи опциональны, зависят от модели и датасета):

source: ``"image_<camera_name>"``: image Tensor of shape ``(3, H, W)``
ru: ``"image_<camera_name>"``: изображение, тензор размерности ``(3, H, W)``

source: ``"mask_<camera_name>"``: semantic segmentation mask Tensor of shape ``(1, H, W)``
ru: ``"mask_<camera_name>"``: маска семантической сегментации, тензор размерности ``(1, H, W)``
